{
    "bauhaus": {
        "title": "Lektionen vom Bauhaus",
        "paragraphs": [
            "Über die Jahre habe ich verschiedene Versionen dieses Vortrags meinen Teams gehalten, um sich vom Bauhaus und seinen verwandten Bewegungen inspirieren zu lassen und ein Rahmenwerk vorzuschlagen, um aktuelle UI-Trends zu verstehen und Lektionen vom Bauhaus für den Aufbau von UI-Design-Systemen anzuwenden."
        ],
        "openPdfAriaLabel": "Lektionen vom Bauhaus Präsentation PDF öffnen (öffnet in neuem Tab)",
        "openPdfText": "PDF öffnen",
        "titleSlideAlt": "Lektionen vom Bauhaus - Titelfolie",
        "viewPresentationLink": "Vollständige Präsentation ansehen (PDF)"
    },
    "bauhauslers": {
        "title": "Bauhäuslers",
        "paragraphs": [
            "Im Jahr des Bauhaus-Jubiläums eine Reise, die den historischen Weg der Schule von Weimar über Dessau nach Berlin nachzeichnet.",
            "Bauhäusler — ein Student des Bauhaus"
        ],
        "imageAlt": "Porträt {number} aus der Bauhäuslers Fotoserie"
    },
    "clock": {
        "ariaLabel": "Aktuelle Zeit in New York"
    },
    "common": {
        "index": "Index",
        "skipToContent": "Zum Inhalt springen"
    },
    "theme": {
        "system": "Systemstandard",
        "light": "Heller Modus",
        "dark": "Dunkler Modus",
        "switchTo": "Wechseln zu {theme}",
        "currentMode": "Aktuell: {mode}. Klicken zum Wechseln."
    },
    "concertLog": {
        "title": "Konzertprotokoll",
        "paragraphs": [
            "Eine Liste besuchter Konzerte.",
            "Gesetzt in Times New Roman, weil IYKYK."
        ],
        "encore": "Zugabe (letzte Show)",
        "indicator": "zeigt mehrere Shows an",
        "live": "LIVE",
        "loading": "Wird geladen",
        "search": "Suchen"
    },
    "githubRepo": {
        "ariaLabel": "{username}/{repoName} Repository auf GitHub öffnen"
    },
    "covidAppointments": {
      "title": "COVID-Terminbenachrichtigungen",
      "image": "Banner-Grafik mit Twilio-Logo und drei Linien, die zum Logo zeigen. Der Titel lautet COVID-19-Impfstoff-Benachrichtigungen mit Twilio Serverless Functions erhalten.",
      "paragraphs": [
        "Dieses Projekt war ein automatisiertes Benachrichtigungssystem, das Airtable und Twilio integrierte, um Sie anzurufen, wenn COVID-19-Impftermine verfügbar wurden. Damals schrieb ich Integrationen mit Systemen in Kalifornien, Massachusetts und New York City sowie mit GetMyVaccine, das Impfstoffverfügbarkeiten von CVS, Rite-Aid und Walgreens aggregierte."      ],
      "setupGuide": "Setup-Anleitung"
    },
    "covidMyturn": {
        "title": "COVID MyTurn CA Monitor",
        "paragraphs": [
            "Dieses Projekt wurde entwickelt, um Impfstoffverfügbarkeitsdaten aus dem Impfsystem des Bundesstaates Kalifornien (MyTurn) für alle 58 Bezirke zu sammeln und zu aggregieren.",
            "Mit CloudWatch programmierte ich ein cron-ausgelöstes Fan-out von serverlosen Lambda-Jobs, um Verfügbarkeitsdaten von MyTurn parallel zu sammeln. Eine separate Lambda-Funktion aggregierte die Ergebnisse und speicherte sie in S3 als einen einzigen kanonischen Datensatz.",
            "Dies war eine Optimierung für <notifier>Impftermin-Benachrichtigungen</notifier>, um direkte Aufrufe an MyTurn zu reduzieren und andere Projekte zu ermöglichen."
        ]
    },
    "homekitMagnepan": {
        "title": "HomeKit-Automatisierung für Magnepans",
        "paragraphs": [
          "Dies ist eine Anleitung, wie ich meine Magnepans so eingerichtet habe, dass sowohl Vinyl- als auch Streaming-Wiedergabe über Apple HomeKit und iOS-Shortcuts gesteuert werden.",
          "![main]",
          "## Kernkomponenten",
          "![rel|magnepan]",
          "### Lautsprecher & Verstärkung",
          "- REL T/5x (Subwoofer)",
          "- Magnepan LRS (Hauptlautsprecher)",
          "- Schiit Vidar (Endverstärker)",
          "### Vorverstärkung & Quellen",
          "- Schiit Modi (DAC)",
          "- Schiit Saga+ w/ Linlai E-6SN7 Röhre (Vorverstärker)",
          "- Darlington Labs MP-7 (Phono-Vorverstärker)",
          "### Quellen",
          "- Sonos Port (digitales Streaming, Systemsteuerung)",
          "- Rega P6 Plattenspieler w/ Exact MM Tonabnehmer",
          "### Verbindungen & Steuerungen",
          "- Snake Oil Taipan RCA-Verbindungskabel",
          "- Blue Jeans Cable Ten White 10AWG Lautsprecherkabel",
          "- Panamax Max 5510 Power Conditioner",
          "- Switchbot Hub 2 (IR-Sender)",
          "- Apple HomeKit via HomePod mini",
          "![panamax]",
          "## Systemsteuerung mit Sonos Port",
          "Alles im Setup dreht sich um den 12V-Trigger-Ausgang des Sonos Port, der über ein 3,5-mm-Mono-Triggerkabel mit dem Panamax Power Conditioner verbunden ist. Wenn der Sonos Port aktiv Musik abspielt, wacht der Panamax auf und schaltet den gesamten Audio-Stack ein (Vorverstärker, Verstärker, Subwoofer usw.)",
          "Wir können HomeKit-Automatisierungen verwenden, um das System ein- und auszuschalten, indem wir einen Ambient-Soundtrack auf dem Sonos Port abspielen (oder stoppen).",
          "## Zu konfigurierende iOS-Shortcuts",
          "Die iOS-Shortcuts, die wir konfigurieren werden, sind:",
          "- HomeKit-Shortcuts: Magnepan einschalten, Magnepan ausschalten",
          "- Switchbot-Shortcuts: Lautstärke erhöhen, Lautstärke verringern, Stumm, Nächste Quelle",
          "### HomeKit-Szene einrichten",
          "Erstellen Sie eine neue Szene, die Audio auf dem Sonos Port-Lautsprecher abspielt (hier Magnepan genannt).",
          "![homekit1]",
          "Wählen Sie Audio abspielen und dann einen Ton aus. Ich verwende Apple Ambient Sounds wie Ocean, da es unendlich wiederholt wird.",
          "![homekit2]",
          "## Systemsteuerung mit Switchbot",
          "Mit dem Switchbot Hub können Sie ihm IR-Signale von Ihrer vorhandenen Fernbedienung beibringen, um sie auf Anfrage wiederzugeben. Ich habe die Signale von der Fernbedienung des Schiit Saga kopiert, damit der Hub Quellenauswahl und Lautstärke steuern kann.",
          "### Switchbot einrichten",
          "Konfigurieren Sie die Switchbot Hub-Fernbedienung und lehren Sie ihr die IR-Signale von der Fernbedienung Ihres Vorverstärkers.",
          "![switchbot_pair|schiit_rc]",
          "Konfigurieren Sie Quick Scenes in der Switchbot-App. Haben Sie eine separate Szene für sowohl Lautstärke erhöhen als auch verringern, die eine Aktion über die Switchbot-Fernbedienung ausführt.",
          "![switchbot_quickscenes|switchbot_editscene]",
          "Sobald Sie die Quick Scene eingerichtet haben, fügen Sie die Quick Scene zu Siri-Shortcuts hinzu (klicken Sie auf Weitere Auslösemöglichkeiten und wählen Sie Siri-Shortcuts).",
          "![switchbot_select|switchbot_siri]",
          "Benennen Sie Ihren Shortcut entsprechend.",
          "![heysiri]",
          "Sobald Sie ihn über die Switchbot-App übermittelt haben, öffnen Sie die iOS-Shortcuts-App und Sie sehen einen Shortcut, der unter Alle Shortcuts erstellt wurde (in diesem Fall 'Volume down').",
          "![homekit_allshortcuts]",
          "### Analog-Übersicht",
          "Vinyl-Wiedergabe weckt das System nicht von selbst auf. Auch während der Vinyl-Wiedergabe wird der Sonos Port absichtlich mit einem Ambient-Looping-Track wach gehalten:",
          "- iOS-Shortcut startet einen Ambient-Looping-Track auf dem Sonos Port",
          "- Dies weckt den Sonos Port auf, der ein Signal über das 12V-Triggerkabel an Panamax sendet",
          "- Panamax wird mit 12V-Trigger aktiviert",
          "- Alle analogen Geräte schalten sich automatisch ein",
          "- Saga+ wird auf Phono-Eingang umgeschaltet",
          "- Vinyl wird über Lautsprecher abgespielt!",
          "#### Analoger Pfad",
          "→ HomeKit-Automatisierung spielt Apple eingebaute Ambient Sounds auf dem Sonos Port 'Speaker' ab",
          "→ 12V-Trigger weckt Panamax Power Conditioner auf, der das gesamte System einschaltet",
          "→ Rega P6 Plattenspieler spielt Schallplatte ab",
          "→ MP-7 Phono-Vorverstärker",
          "→ Saga+ Vorverstärker (auf Phono-Eingang eingestellt – das Ambient-Audio von Sonos hält das System wach, wird aber nicht gehört)",
          "→ Vidar Verstärker",
          "→ Magnepan LRS + REL T/5X",
          "### Digital-Übersicht",
          "Die digitale Wiedergabe ist einfach: Starten Sie Musik auf dem Sonos Port über AirPlay oder die Sonos-App, und der 12V-Trigger schaltet das System automatisch ein. Solange der Saga+ auf den DAC-Eingang eingestellt ist, wird Musik zu den Lautsprechern gestreamt.",
          "#### Digitaler Streaming-Pfad",
          "→ Sonos Port 'Speaker' spielt aktiv Musik von digitalen Streaming-Plattformen ab",
          "→ 12V-Trigger weckt Panamax Power Conditioner auf, der das gesamte System einschaltet",
          "→ Schiit Modi DAC",
          "→ Saga+ Vorverstärker (auf digitale Quelle eingestellt)",
          "→ Vidar Verstärker",
          "→ Magnepan LRS + REL T/5x",
          "---",
          "Mit diesem Setup kann ich das System mit iOS-Shortcuts einschalten und steuern. Da der Sonos Port nur dann ein Signal über den 12V-DC-Trigger an den Power Conditioner sendet, während Audio abgespielt wird, schaltet sich das System nach einer kurzen Verzögerung automatisch aus, sobald die Audiowiedergabe stoppt. Das war's!",
          "![video:record]",
          "P.S. Schauen Sie sich meine Plattensammlung auf <discogs>Discogs</discogs> an!"
        ],
        "images": {
            "main": "Rega P6 Plattenspieler mit Schallplatten im Regal",
            "magnepan": "Magnepan LRS Lautsprecher und REL T/5x Subwoofer",
            "panamax": "Panamax Max 5510 Power Conditioner",
            "homekit1": "HomeKit neue Szeneneinrichtung mit ausgewähltem Magnepan-Lautsprecher",
            "homekit2": "HomeKit Medieneinstellungen zeigen Audio abspielen mit ausgewähltem Ocean Ambient Sound",
            "switchbot_pair": "Switchbot Hub lernt IR-Signale von Fernbedienung",
            "schiit_rc": "Schiit Saga Fernbedienung",
            "switchbot_quickscenes": "Switchbot Quick Scenes zeigen Sound down und Sound up",
            "switchbot_editscene": "Switchbot Szene bearbeiten Konfiguration für Lautstärkeregelung",
            "switchbot_siri": "Switchbot Weitere Auslösemöglichkeiten Menü und Siri Shortcuts-Integration",
            "heysiri": "Hey Siri Sprachbefehl-Animation für Sound down",
            "switchbot_select": "Benennung des Siri-Shortcuts für Switchbot-Szene",
            "homekit_allshortcuts": "iOS Shortcuts-App zeigt Magnepan-Lautstärkeregelungs-Shortcuts"
        }
    },
    "home": {
        "title": "Devin Nguyen",
        "description": "Software-Ingenieur",
        "intro": "Ich bin ein Full-Stack-Software-Ingenieur mit Sitz in New York City und baue derzeit die intelligente Automatisierungsplattform für das Gesundheitswesen bei <tennr>Tennr</tennr>.",
        "previously": "Zuvor war ich Principal Software Engineer bei <aidkit>AidKit</aidkit>, wo ich Infrastruktur für Regierungen und gemeinnützige Organisationen zur Modernisierung und Skalierung der Leistungserbringung aufgebaut habe, und bei <hypr>HYPR</hypr>, wo ich passwortlose Authentifizierungslösungen für Finanzinstitute und Startups entwickelt habe.",
        "before": "Davor war ich Senior Member of Technical Staff bei <cloudhealth>CloudHealth</cloudhealth> von <vmware>VMware</vmware> und baute Lösungen für Cloud-Governance, Kostenoptimierung und Compliance im Unternehmensmaßstab.",
        "links": {
            "bauhaus": "Lektionen vom Bauhaus",
            "bauhaus_photo": "Bauhäuslers",
            "ca_wildfire_mcp": "MCP: LA-Waldbrände mit KI kartieren",
            "concerts": "Konzertprotokoll",
            "covid_appointments": "COVID-Terminbenachrichtigungen",
            "covid_myturn": "COVID MyTurn CA Monitor",
            "discogs": "Discogs",
            "github": "GitHub",
            "homekit_magnepan": "HomeKit-Automatisierung für Magnepans",
            "la_main_ouverte": "La Main Ouverte",
            "linkedin": "LinkedIn",
            "live": "LIVE",
            "se1": "(S)E1"
        },
        "sections": {
            "connect": "Verbinden",
            "photography": "Fotografie",
            "writing": "Schreiben"
        },
        "skipToContent": "Zum Inhalt springen"
    },
    "laMainOuverte": {
        "title": "La Main Ouverte",
        "icon": "La Main Ouverte Symbol in Form einer offenen Hand",
        "paragraphs": [
            "Nur wenige Stunden nördlich von Neu-Delhi gelegen, ist Chandigarh eine geplante Stadt, die aus einer ungewöhnlichen Zusammenarbeit mit einem ehrgeizigen Geist nach Indiens Unabhängigkeit entstanden ist. Nach der Teilung Indiens 1947 wurde die Punjab-Provinz Britisch-Indiens zwischen Indien und Pakistan aufgeteilt. Jawaharlal Nehru, Indiens erster Premierminister, begann eine gemeinsame Anstrengung mit Le Corbusier, eine utopische Stadt zu bauen, die als gemeinsame Hauptstadt von Punjab und Haryana fungieren sollte. Es ist ein modernes, brutalistisches Paradies, das in den 1960er Jahren fertiggestellt wurde und den Grundstein für einen radikalen Neuanfang für Indien legen sollte und war eines von Le Corbusiers wegweisenden Werken in der Architektur.",
            "Die Offene Hand, oder La Main Ouverte, war ein wiederkehrendes Motiv in Le Corbusiers Werk und wurde zum bestimmenden Symbol von Chandigarh."
        ],
        "attribution": "Le Corbusier",
        "pullquote": "\"Sie dreht sich mit dem Wind, nicht ziellos, sondern um auszudrücken, was das Leben wirklich ist: ständiger Wandel. Die Hand ist offen, um zu geben und zu empfangen. Es ist ein Zeichen des Optimismus in dieser Welt der Katastrophe.\"",
        "imageAlt": "Fotografie {number} aus der La Main Ouverte Architekturserie"
    },
    "mcpWildfire": {
        "title": "MCP: LA-Waldbrände mit KI kartieren",
        "image": "Diagramm, das Kartenebenen mit einer Beschreibung jeder Ebene zeigt (von unten nach oben): Basiskarte von Los Angeles, Evakuierungszone, Aktive Brandzone, Schadensbewertung und Schadensfotos",
        "paragraphs": [
            "Als Reaktion auf die Waldbrände vom Januar 2025 in Los Angeles arbeitete <aidkit>AidKit</aidkit> mit Los Angeles County und der Stadt Los Angeles zusammen, um schnell zwei Programme für Bargeld-Katastrophenhilfe zu starten.",
            "Ich leitete das Design und die Implementierung der neuen geospatialen Fähigkeiten der Plattform für Katastrophenhilfe. Dies umfasste den Aufbau einer Synchronisations-Pipeline, die Daten von entfernten Steuerparzellen-Datensätzen und CAL FIRE-Schadensinspektionsdaten aufnahm und normalisierte und sie in PostGIS für räumliche Abfragen speicherte. Wir nutzten diese Daten, um Antragsteller automatisch basierend auf dem Einfluss auf Parzellenebene zu triagieren, wodurch manuelle Überprüfungen reduziert und die Hilfslieferung beschleunigt wurde.",
            "Ich baute auch interaktive Echtzeit-Karten, um Interessengruppen Live-Einblicke in die Programmreichweite und Berechtigung zu geben. Diese Programme verteilten schließlich über 25 Millionen Dollar direkte Hilfe an Einzelpersonen und kleine Unternehmen in Los Angeles.",
            "Dieses Projekt inspirierte mich zu erforschen, wie KI und MCP-Server die Programmverwaltung beschleunigen können. Zum Beispiel könnten wir ein LLM mit CAL FIREs Schadensdaten verbinden, um eine breitere Palette automatisierter Triage- und Berechtigungs-Workflows zu ermöglichen."
        ],
        "readMore": "Mehr über die Programme lesen",
        "caseStudy": "AidKit Fallstudie",
        "award": "2025 Stevie Awards für technische Exzellenz",
        "routeFifty": "Route Fifty",
        "santaMonicaDailyPress": "Santa Monica Daily Press",
        "santaMonicaMirror": "Santa Monica Mirror",
        "secretLosAngeles": "Secret Los Angeles",
        "nbc": "NBC Los Angeles",
        "latimes": "Los Angeles Times",
        "lacounty": "County of Los Angeles",
        "github": {
            "sectionTitle": "MCP Server-Implementierung",
            "linkTitle": "GitHub"
        }
    },
    "notFound": {
        "title": "404",
        "subtitle": "Seite nicht gefunden",
        "message": "Die gesuchte Seite existiert nicht.",
        "returnHome": "Zur Startseite"
    },
    "se1": {
        "title": "(S)E1",
        "paragraphs": [
            "Pendelszenen in London von E1 nach SE1"
        ],
        "imageAlt": "Fotografie {number} aus der SE1 Filmfotografie-Sammlung"
    }
}