{
    "bauhaus": {
        "title": "Lecciones del Bauhaus",
        "paragraphs": [
            "A lo largo de los años, he presentado variaciones de esta charla a mis equipos, tomando inspiración del Bauhaus y sus movimientos de diseño relacionados. La charla describe un marco para interpretar las tendencias modernas de UI y aplica principios y lecciones del Bauhaus a la creación de sistemas de diseño UI escalables y cohesivos."
        ],
        "openPdfAriaLabel": "Abrir presentación Lecciones del Bauhaus PDF (se abre en nueva pestaña)",
        "openPdfText": "Abrir PDF",
        "titleSlideAlt": "Lecciones del Bauhaus - Diapositiva de título",
        "viewPresentationLink": "Ver presentación completa (PDF)"
    },
    "bauhauslers": {
        "title": "Bauhäuslers",
        "paragraphs": [
            "En el año del centenario de la Bauhaus, un viaje retrazando el camino histórico de la escuela desde Weimar pasando por Dessau hasta Berlín.",
            "Bauhäusler — un estudiante del Bauhaus"
        ],
        "imageAlt": "Retrato {number} de la serie fotográfica Bauhäuslers"
    },
    "clock": {
        "ariaLabel": "Hora actual en Nueva York"
    },
    "common": {
        "index": "Índice",
        "skipToContent": "Saltar al contenido"
    },
    "theme": {
        "system": "predeterminado del sistema",
        "light": "modo claro",
        "dark": "modo oscuro",
        "switchTo": "Cambiar a {theme}",
        "currentMode": "Actual: {mode}. Haz clic para cambiar."
    },
    "concertLog": {
        "title": "Registro de conciertos",
        "paragraphs": [
            "Una lista de conciertos a los que he asistido.",
            "Configurado en Times New Roman porque IYKYK."
        ],
        "encore": "Bis (último show)",
        "indicator": "indica múltiples shows",
        "live": "EN VIVO",
        "loading": "Cargando",
        "search": "Buscar"
    },
    "githubRepo": {
        "ariaLabel": "Abrir repositorio {username}/{repoName} en GitHub"
    },
    "covidAppointments": {
      "title": "Notificaciones de citas COVID",
      "image": "Gráfico banner con el logo de Twilio y tres líneas apuntando hacia el logo. El título dice Recibe notificaciones de vacuna COVID-19 usando Twilio Serverless Functions.",
      "paragraphs": [
        "Este proyecto fue un sistema de notificación automatizado que integraba Airtable y Twilio para llamarte cuando las citas de vacunas COVID-19 estuvieran disponibles. En ese momento, escribí integraciones con sistemas en California, Massachusetts y la ciudad de Nueva York, así como con GetMyVaccine que agregaba disponibilidades de vacunas de CVS, Rite-Aid y Walgreens."      ],
      "setupGuide": "Guía de Configuración"
    },
    "covidMyturn": {
        "title": "Monitor COVID MyTurn CA",
        "paragraphs": [
            "Este proyecto fue construido para recopilar y agregar datos de disponibilidad de vacunas del sistema de vacunación del estado de California (MyTurn), cubriendo los 58 condados.",
            "Usando CloudWatch, programé una distribución en abanico activada por cron de trabajos Lambda serverless para recopilar datos de disponibilidad de MyTurn en paralelo. Una función Lambda separada agregó los resultados y los almacenó en S3 como un conjunto de datos canónico único.",
            "Esta fue una optimización para <notifier>Notificaciones de citas de vacunación</notifier> para reducir las llamadas directas a MyTurn y habilitar otros proyectos."
        ]
    },
    "homekitMagnepan": {
        "title": "Automatización HomeKit para Magnepans",
        "paragraphs": [
          "Este es un tutorial de cómo configuré mis Magnepans para que tanto la reproducción de vinilo como la de streaming se controlen a través de Apple HomeKit y atajos de iOS.",
          "![main]",
          "## Componentes principales",
          "![rel|magnepan]",
          "### Altavoces y amplificación",
          "- REL T/5x (subwoofer)",
          "- Magnepan LRS (altavoces principales)",
          "- Schiit Vidar (amplificador de potencia)",
          "### Preamplificación y fuentes",
          "- Schiit Modi (DAC)",
          "- Schiit Saga+ w/ tubo Linlai E-6SN7 (preamplificador)",
          "- Darlington Labs MP-7 (preamplificador de phono)",
          "### Fuentes",
          "- Sonos Port (streaming digital, control del sistema)",
          "- Tocadiscos Rega P6 w/ cápsula Exact MM",
          "### Conexiones y controles",
          "- Interconectores RCA Snake Oil Taipan",
          "- Cables de altavoz Blue Jeans Cable Ten White 10AWG",
          "- Acondicionador de energía Panamax Max 5510",
          "- Switchbot Hub 2 (emisor IR)",
          "- Apple HomeKit vía HomePod mini",
          "![panamax]",
          "## Control del sistema con Sonos Port",
          "Todo en la configuración gira en torno a la salida de disparo de 12V del Sonos Port, que está conectada al acondicionador de energía Panamax mediante un cable de disparo mono de 3,5 mm. Cuando el Sonos Port está reproduciendo música activamente, el Panamax se activará y encenderá toda la cadena de audio (preamplificadores, amplificador, subwoofer, etc.)",
          "Podemos usar automatizaciones de HomeKit para encender y apagar el sistema reproduciendo (o deteniendo) una banda sonora ambiental en el Sonos Port.",
          "## Atajos de iOS a configurar",
          "Los atajos de iOS que configuraremos son:",
          "- Atajos de HomeKit: Encender Magnepan, Apagar Magnepan",
          "- Atajos de Switchbot: Subir volumen, Bajar volumen, Silenciar, Siguiente fuente",
          "### Configuración de escena de HomeKit",
          "Crea una nueva escena que reproduzca audio en el altavoz Sonos Port (llamado Magnepan aquí).",
          "![homekit1]",
          "Elige Reproducir audio y luego selecciona un sonido. Yo uso sonidos ambientales de Apple como Ocean ya que se reproducirá indefinidamente.",
          "![homekit2]",
          "## Control del sistema con Switchbot",
          "Con el Hub Switchbot, puedes enseñarle señales IR de tu control remoto existente para reproducirlas bajo demanda. Copié las señales del control remoto del Schiit Saga para que el hub pueda controlar la selección de fuente y el volumen.",
          "### Configuración de Switchbot",
          "Configura el control remoto del Hub Switchbot y enséñale las señales IR del control remoto de tu preamplificador.",
          "![switchbot_pair|schiit_rc]",
          "Configura escenas rápidas en la aplicación Switchbot. Ten una escena separada tanto para Subir volumen como para Bajar que realice una acción a través del control remoto Switchbot.",
          "![switchbot_quickscenes|switchbot_editscene]",
          "Una vez que tengas la escena rápida configurada, agrega la escena rápida a los atajos de Siri (haz clic en Más formas de activar y selecciona Atajos de Siri).",
          "![switchbot_select|switchbot_siri]",
          "Nombra tu atajo en consecuencia.",
          "![heysiri]",
          "Una vez que lo envíes a través de la aplicación Switchbot, abre la aplicación de Atajos de iOS y verás un atajo creado bajo Todos los atajos ('Volume down' en este caso).",
          "![homekit_allshortcuts]",
          "### Descripción general analógica",
          "La reproducción de vinilo no activa el sistema de forma inherente. Incluso durante la reproducción de vinilo, el Sonos Port se mantiene intencionalmente activo con una pista ambiental en bucle:",
          "- El atajo de iOS inicia una pista ambiental en bucle en el Sonos Port",
          "- Esto activa el Sonos Port, que emite una señal a través del cable de disparo de 12V a Panamax",
          "- Panamax se activa con el disparo de 12V",
          "- Todo el equipo analógico se enciende automáticamente",
          "- Saga+ se cambia a la entrada de phono",
          "- ¡El vinilo se reproduce a través de los altavoces!",
          "#### Ruta analógica",
          "→ La automatización de HomeKit reproduce sonidos ambientales integrados de Apple en el 'Altavoz' Sonos Port",
          "→ El disparo de 12V activa el acondicionador de energía Panamax que enciende todo el sistema",
          "→ El tocadiscos Rega P6 reproduce el disco",
          "→ Preamplificador de phono MP-7",
          "→ Preamplificador Saga+ (configurado en entrada de phono: el audio ambiental de Sonos mantiene el sistema activo pero no se escucha)",
          "→ Amplificador Vidar",
          "→ Magnepan LRS + REL T/5X",
          "### Descripción general digital",
          "La reproducción digital es sencilla: inicia música en el Sonos Port a través de AirPlay o la aplicación Sonos, y el disparo de 12V enciende el sistema automáticamente. Mientras el Saga+ esté configurado en la entrada DAC, la música se transmite a los altavoces.",
          "#### Ruta de streaming digital",
          "→ El 'Altavoz' Sonos Port está reproduciendo activamente música de plataformas de streaming digital",
          "→ El disparo de 12V activa el acondicionador de energía Panamax que enciende todo el sistema",
          "→ DAC Schiit Modi",
          "→ Preamplificador Saga+ (seleccionado a fuente digital)",
          "→ Amplificador Vidar",
          "→ Magnepan LRS + REL T/5x",
          "---",
          "Con esta configuración, puedo encender y controlar el sistema con atajos de iOS. Dado que el Sonos Port solo emite una señal a través del disparo DC de 12V al acondicionador de energía mientras se reproduce audio, el sistema se apagará automáticamente después de un breve retraso una vez que se detenga la reproducción de audio. ¡Eso es todo!",
          "![video:record]",
          "P.D. ¡Echa un vistazo a mi colección de discos en <discogs>Discogs</discogs>!"
        ],
        "images": {
            "main": "Tocadiscos Rega P6 con discos de vinilo en estante",
            "magnepan": "Altavoces Magnepan LRS y subwoofer REL T/5x",
            "panamax": "Acondicionador de energía Panamax Max 5510",
            "homekit1": "Configuración de nueva escena de HomeKit con altavoz Magnepan seleccionado",
            "homekit2": "Configuración de medios de HomeKit mostrando Reproducir audio con sonido ambiental Ocean seleccionado",
            "switchbot_pair": "Hub Switchbot aprendiendo señales IR del control remoto",
            "schiit_rc": "Control remoto Schiit Saga",
            "switchbot_quickscenes": "Escenas rápidas de Switchbot mostrando Sound down y Sound up",
            "switchbot_editscene": "Configuración de edición de escena de Switchbot para control de volumen",
            "switchbot_siri": "Menú Más formas de activar de Switchbot e integración de Atajos de Siri",
            "heysiri": "Animación de comando de voz Hey Siri para Sound down",
            "switchbot_select": "Nombrando el atajo de Siri para escena de Switchbot",
            "homekit_allshortcuts": "Aplicación de Atajos de iOS mostrando atajos de control de volumen de Magnepan"
        }
    },
    "home": {
        "title": "Devin Nguyen",
        "description": "Ingeniero de software",
        "intro": "Soy un ingeniero de software full-stack con sede en Nueva York, actualmente construyendo la plataforma de automatización inteligente para operaciones de salud en <tennr>Tennr</tennr>.",
        "previously": "Anteriormente, fui Ingeniero Principal de Software en <aidkit>AidKit</aidkit>, donde construí infraestructura para que gobiernos y organizaciones sin fines de lucro modernicen y escalen la entrega de beneficios, y en <hypr>HYPR</hypr>, donde construí soluciones de autenticación sin contraseña para instituciones financieras y startups.",
        "before": "Antes de eso, fui Miembro Senior del Equipo Técnico en <cloudhealth>CloudHealth</cloudhealth> de <vmware>VMware</vmware>, construyendo soluciones para gobernanza en la nube, optimización de costos y cumplimiento a escala empresarial.",
        "links": {
            "bauhaus": "Lecciones del Bauhaus",
            "bauhaus_photo": "Bauhäuslers",
            "ca_wildfire_mcp": "MCP: Mapear incendios forestales de LA con IA",
            "concerts": "Registro de conciertos",
            "covid_appointments": "Notificaciones de citas COVID",
            "covid_myturn": "Monitor COVID MyTurn CA",
            "discogs": "Discogs",
            "github": "GitHub",
            "homekit_magnepan": "Automatización HomeKit para Magnepans",
            "la_main_ouverte": "La Main Ouverte",
            "linkedin": "LinkedIn",
            "live": "EN VIVO",
            "se1": "(S)E1"
        },
        "sections": {
            "connect": "Conectar",
            "photography": "Fotografía",
            "writing": "Escritura"
        },
        "skipToContent": "Saltar al contenido"
    },
    "laMainOuverte": {
        "title": "La Main Ouverte",
        "icon": "Símbolo de La Main Ouverte en forma de mano abierta",
        "paragraphs": [
            "Ubicada a solo unas horas al norte de Nueva Delhi, Chandigarh es una ciudad planificada nacida de una colaboración inusual con un espíritu ambicioso tras la independencia de India. Después de la partición de India en 1947, la provincia de Punjab de la India británica se dividió entre India y Pakistán. Jawaharlal Nehru, el primer Primer Ministro de India, se embarcó en un esfuerzo conjunto con Le Corbusier para construir una ciudad utópica que actuaría como capital compartida de Punjab y Haryana. Es un paraíso moderno y brutalista que se completó en los años 1960 y estaba destinado a sentar las bases para un nuevo comienzo radical para India y fue una de las obras arquitectónicas seminales de Le Corbusier.",
            "La Mano Abierta, o La Main Ouverte, fue un motivo recurrente a lo largo del trabajo de Le Corbusier y se convirtió en el símbolo definitorio de Chandigarh."
        ],
        "attribution": "Le Corbusier",
        "pullquote": "\"Gira con el viento, no sin rumbo, sino para expresar lo que realmente es la vida: cambio constante. La mano está abierta para dar y recibir. Es una señal de optimismo en este mundo de catástrofe.\"",
        "imageAlt": "Fotografía {number} de la serie arquitectónica La Main Ouverte"
    },
    "mcpWildfire": {
        "title": "MCP: Mapear incendios forestales de LA con IA",
        "image": "Diagrama mostrando capas de un mapa con una descripción de cada capa (de abajo hacia arriba): Mapa base de Los Ángeles, Zona de evacuación, Zona de incendio activo, Evaluación de daños y Fotografías de daños",
        "paragraphs": [
            "En respuesta a los incendios forestales de enero de 2025 en Los Ángeles, <aidkit>AidKit</aidkit> se asoció con el Condado de Los Ángeles y la Ciudad de Los Ángeles para lanzar rápidamente dos programas de ayuda económica de emergencia.",
            "Lideré el diseño e implementación de las nuevas capacidades geoespaciales de la plataforma para respuesta a desastres. Esto incluyó construir un pipeline de sincronización que ingería y normalizaba datos de conjuntos de datos remotos de parcelas fiscales y datos de inspección de daños de CAL FIRE, almacenándolos en PostGIS para consultas espaciales. Usamos estos datos para hacer triage automáticamente de los solicitantes según el impacto a nivel de parcela, reduciendo la revisión manual y acelerando la entrega de ayuda.",
            "También construí mapas interactivos en tiempo real para dar a las partes interesadas visibilidad en vivo sobre el alcance del programa y la cobertura de elegibilidad. Estos programas finalmente distribuyeron más de $25M en ayuda directa a individuos y pequeñas empresas en Los Ángeles.",
            "Este proyecto me inspiró a explorar cómo la IA y los servidores MCP pueden acelerar la administración de programas. Por ejemplo, podríamos conectar un LLM a los datos de daños de CAL FIRE para habilitar una gama más amplia de flujos de trabajo automatizados de triaje y elegibilidad."
        ],
        "readMore": "Leer más sobre los programas",
        "caseStudy": "Caso de estudio de AidKit",
        "award": "Premios Stevie 2025 por Excelencia Tecnológica",
        "routeFifty": "Route Fifty",
        "santaMonicaDailyPress": "Santa Monica Daily Press",
        "santaMonicaMirror": "Santa Monica Mirror",
        "secretLosAngeles": "Secret Los Angeles",
        "nbc": "NBC Los Angeles",
        "latimes": "Los Angeles Times",
        "lacounty": "County of Los Angeles",
        "github": {
            "sectionTitle": "Implementación del servidor MCP",
            "linkTitle": "GitHub"
        }
    },
    "notFound": {
        "title": "404",
        "subtitle": "Página no encontrada",
        "message": "La página que buscas no existe.",
        "returnHome": "Volver al inicio"
    },
    "se1": {
        "title": "(S)E1",
        "paragraphs": [
            "Escenas de viaje en Londres de E1 a SE1"
        ],
        "imageAlt": "Fotografía {number} de la colección de fotografía cinematográfica SE1"
    }
}