{
    "bauhaus": {
        "title": "Lecciones del Bauhaus",
        "paragraphs": [
            "A lo largo de los años, he presentado variaciones de esta charla a mis equipos, tomando inspiración del Bauhaus y sus movimientos de diseño relacionados. La charla describe un marco para interpretar las tendencias modernas de UI y aplica principios y lecciones del Bauhaus a la creación de sistemas de diseño UI escalables y cohesivos."
        ],
        "openPdfAriaLabel": "Abrir presentación Lecciones del Bauhaus PDF (se abre en nueva pestaña)",
        "openPdfText": "Abrir PDF",
        "titleSlideAlt": "Lecciones del Bauhaus - Diapositiva de título",
        "viewPresentationLink": "Ver presentación completa (PDF)"
    },
    "bauhauslers": {
        "title": "Bauhäuslers",
        "paragraphs": [
            "Un viaje trazando la ruta histórica del movimiento Bauhaus desde Weimar hasta Dessau y Berlín durante la celebración del centenario.",
            "Bauhäusler — un estudiante del Bauhaus"
        ],
        "imageAlt": "Retrato {number} de la serie fotográfica Bauhäuslers"
    },
    "clock": {
        "ariaLabel": "Reloj mostrando {time} ET"
    },
    "common": {
        "index": "Índice",
        "skipToContent": "Saltar al contenido"
    },
    "theme": {
        "system": "predeterminado del sistema",
        "light": "modo claro",
        "dark": "modo oscuro",
        "switchTo": "Cambiar a {theme}",
        "currentMode": "Actual: {mode}. Haz clic para cambiar."
    },
    "concertLog": {
        "title": "Registro de conciertos",
        "paragraphs": [
            "Una lista de conciertos a los que he asistido.",
            "Configurado en Times New Roman porque IYKYK."
        ],
        "encore": "Bis (último show)",
        "indicator": "indica múltiples shows",
        "live": "EN VIVO",
        "loading": "Cargando",
        "search": "Buscar"
    },
    "githubRepo": {
        "ariaLabel": "Abrir repositorio {username}/{repoName} en GitHub"
    },
    "covidAppointments": {
      "title": "Notificaciones de citas COVID",
      "image": "Gráfico banner con el logo de Twilio y tres líneas apuntando hacia el logo. El título dice Recibe notificaciones de vacuna COVID-19 usando Twilio Serverless Functions.",
      "paragraphs": [
        "Este proyecto fue un sistema de notificación automatizado que integraba Airtable y Twilio para llamarte cuando las citas de vacunas COVID-19 estuvieran disponibles. En ese momento, escribí integraciones con sistemas en California, Massachusetts y la ciudad de Nueva York, así como con GetMyVaccine que agregaba disponibilidades de vacunas de CVS, Rite-Aid y Walgreens."      ],
      "setupGuide": "Guía de Configuración"
    },
    "covidMyturn": {
        "title": "Monitor COVID MyTurn CA",
        "paragraphs": [
            "Este proyecto fue construido para recopilar y agregar datos de disponibilidad de vacunas del sistema de vacunación del estado de California (MyTurn), cubriendo los 58 condados.",
            "Usando CloudWatch, programé una distribución en abanico activada por cron de trabajos Lambda serverless para recopilar datos de disponibilidad de MyTurn en paralelo. Una función Lambda separada agregó los resultados y los almacenó en S3 como un conjunto de datos canónico único.",
            "Esta fue una optimización para <notifier>Notificaciones de citas de vacunación</notifier> para reducir las llamadas directas a MyTurn y habilitar otros proyectos."
        ]
    },
    "home": {
        "title": "Devin Nguyen",
        "description": "Ingeniero de software",
        "intro": "Soy un ingeniero de software full-stack con sede en Nueva York, actualmente construyendo infraestructura para que gobiernos y organizaciones sin fines de lucro modernicen y escalen la entrega de beneficios en <aidkit>AidKit</aidkit>.",
        "hypr": "Anteriormente, fui Ingeniero Principal de Software en <hypr>HYPR</hypr>, donde construí infraestructura de autenticación sin contraseña confiable para bancos, universidades y startups.",
        "cht": "Antes de eso, fui Miembro Senior del Equipo Técnico en <cloudhealth>CloudHealth</cloudhealth> de <vmware>VMware</vmware>, construyendo soluciones para gobernanza en la nube, optimización de costos y cumplimiento a escala empresarial.",
        "links": {
            "bauhaus": "Lecciones del Bauhaus",
            "bauhaus_photo": "Bauhäuslers",
            "ca_wildfire_mcp": "MCP: Mapear incendios forestales de LA con IA",
            "concerts": "Registro de conciertos",
            "covid_appointments": "Notificaciones de citas COVID",
            "covid_myturn": "Monitor COVID MyTurn CA",
            "discogs": "Discogs",
            "github": "GitHub",
            "la_main_ouverte": "La Main Ouverte",
            "linkedin": "LinkedIn",
            "live": "EN VIVO",
            "se1": "(S)E1"
        },
        "sections": {
            "connect": "Conectar",
            "photography": "Fotografía",
            "writing": "Escritura"
        },
        "skipToContent": "Saltar al contenido"
    },
    "laMainOuverte": {
        "title": "La Main Ouverte",
        "icon": "Símbolo de La Main Ouverte en forma de mano abierta",
        "paragraphs": [
            "Ubicada a solo unas horas al norte de Nueva Delhi, Chandigarh es una ciudad planificada nacida de una colaboración inusual con un espíritu ambicioso tras la independencia de India. Después de la partición de India en 1947, la provincia de Punjab de la India británica se dividió entre India y Pakistán. Jawaharlal Nehru, el primer Primer Ministro de India, se embarcó en un esfuerzo conjunto con Le Corbusier para construir una ciudad utópica que actuaría como capital compartida de Punjab y Haryana. Es un paraíso moderno y brutalista que se completó en los años 1960 y estaba destinado a sentar las bases para un nuevo comienzo radical para India y fue una de las obras arquitectónicas seminales de Le Corbusier.",
            "La Mano Abierta, o La Main Ouverte, fue un motivo recurrente a lo largo del trabajo de Le Corbusier y se convirtió en el símbolo definitorio de Chandigarh."
        ],
        "attribution": "Le Corbusier",
        "pullquote": "\"Gira con el viento, no sin rumbo, sino para expresar lo que realmente es la vida: cambio constante. La mano está abierta para dar y recibir. Es una señal de optimismo en este mundo de catástrofe.\"",
        "imageAlt": "Fotografía {number} de la serie arquitectónica La Main Ouverte"
    },
    "mcpWildfire": {
        "title": "MCP: Mapear incendios forestales de LA con IA",
        "image": "Diagrama mostrando capas de un mapa con una descripción de cada capa (de abajo hacia arriba): Mapa base de Los Ángeles, Zona de evacuación, Zona de incendio activo, Evaluación de daños y Fotografías de daños",
        "paragraphs": [
            "En respuesta a los incendios forestales de enero de 2025 en Los Ángeles, <aidkit>AidKit</aidkit> se asoció con el Condado de Los Ángeles y la Ciudad de Los Ángeles para lanzar rápidamente dos programas de ayuda económica de emergencia.",
            "Lideré el diseño e implementación de las nuevas capacidades geoespaciales de la plataforma para respuesta a desastres. Esto incluyó construir un pipeline de sincronización que ingería y normalizaba datos de conjuntos de datos remotos de parcelas fiscales y datos de inspección de daños de CAL FIRE, almacenándolos en PostGIS para consultas espaciales. Usamos estos datos para hacer triage automáticamente de los solicitantes según el impacto a nivel de parcela, reduciendo la revisión manual y acelerando la entrega de ayuda.",
            "También construí mapas interactivos en tiempo real para dar a las partes interesadas visibilidad en vivo sobre el alcance del programa y la cobertura de elegibilidad. Estos programas finalmente distribuyeron más de $25M en ayuda directa a individuos y pequeñas empresas en Los Ángeles.",
            "Este proyecto me inspiró a explorar cómo la IA y los servidores MCP pueden acelerar la administración de programas. Por ejemplo, podríamos conectar un LLM a los datos de daños de CAL FIRE para habilitar una gama más amplia de flujos de trabajo automatizados de triaje y elegibilidad."
        ],
        "readMore": "Leer más sobre los programas",
        "caseStudy": "Caso de estudio de AidKit",
        "award": "Premios Stevie 2025 por Excelencia Tecnológica",
        "routeFifty": "Route Fifty",
        "santaMonicaDailyPress": "Santa Monica Daily Press",
        "santaMonicaMirror": "Santa Monica Mirror",
        "secretLosAngeles": "Secret Los Angeles",
        "nbc": "NBC Los Angeles",
        "latimes": "Los Angeles Times",
        "lacounty": "County of Los Angeles",
        "github": {
            "sectionTitle": "Implementación del servidor MCP",
            "linkTitle": "GitHub"
        }
    },
    "notFound": {
        "title": "404",
        "subtitle": "Página no encontrada",
        "message": "La página que buscas no existe.",
        "returnHome": "Volver al inicio"
    },
    "se1": {
        "title": "(S)E1",
        "paragraphs": [
            "Escenas de viaje en Londres de E1 a SE1"
        ],
        "imageAlt": "Fotografía {number} de la colección de fotografía cinematográfica SE1"
    }
}