{
    "bauhaus": {
        "title": "Leçons du Bauhaus",
        "paragraphs": [
            "Au fil des années, j'ai présenté des variations de cette présentation à mes équipes, puisant l'inspiration du Bauhaus et de ses mouvements de design associés. La présentation décrit un cadre pour interpréter les tendances UI modernes et applique les principes et leçons du Bauhaus à la création de systèmes de design UI évolutifs et cohérents."
        ],
        "openPdfAriaLabel": "Ouvrir la présentation Leçons du Bauhaus PDF (s'ouvre dans un nouvel onglet)",
        "openPdfText": "Ouvrir PDF",
        "titleSlideAlt": "Leçons du Bauhaus - Diapositive de titre",
        "viewPresentationLink": "Voir la présentation complète (PDF)"
    },
    "bauhauslers": {
        "title": "Bauhäuslers",
        "paragraphs": [
            "Un voyage retraçant le parcours historique du mouvement Bauhaus de Weimar à Dessau puis Berlin lors de la célébration du centenaire.",
            "Bauhäusler — un étudiant du Bauhaus"
        ],
        "imageAlt": "Portrait {number} de la série photographique Bauhäuslers"
    },
    "clock": {
        "ariaLabel": "Horloge affichant {time} HE"
    },
    "common": {
        "index": "Index",
        "skipToContent": "Aller au contenu"
    },
    "theme": {
        "system": "défaut du système",
        "light": "mode clair",
        "dark": "mode sombre",
        "switchTo": "Changer vers {theme}",
        "currentMode": "Actuel : {mode}. Cliquez pour changer."
    },
    "concertLog": {
        "title": "Journal de concerts",
        "paragraphs": [
            "Une liste de concerts auxquels j'ai assisté.",
            "Composé en Times New Roman parce que IYKYK."
        ],
        "encore": "Rappel (dernier spectacle)",
        "indicator": "indique plusieurs spectacles",
        "live": "EN DIRECT",
        "loading": "Chargement",
        "search": "Rechercher"
    },
    "githubRepo": {
        "ariaLabel": "Ouvrir le dépôt {username}/{repoName} sur GitHub"
    },
    "covidAppointments": {
      "title": "Notifications de rendez-vous COVID",
      "image": "Graphique bannière avec le logo de Twilio et trois lignes pointant vers le logo. Le titre indique Recevoir des notifications de vaccin COVID-19 en utilisant les fonctions sans serveur Twilio.",
      "paragraphs": [
        "Ce projet était un système de notification automatisé qui intégrait Airtable et Twilio pour vous appeler lorsque des rendez-vous de vaccination COVID-19 devenaient disponibles. À l'époque, j'ai écrit des intégrations avec des systèmes en Californie, au Massachusetts et dans la ville de New York, ainsi qu'avec GetMyVaccine qui agrégeait les disponibilités de vaccins de CVS, Rite-Aid et Walgreens."      ],
      "setupGuide": "Guide de Configuration"
    },
    "covidMyturn": {
        "title": "Moniteur COVID MyTurn CA",
        "paragraphs": [
            "Ce projet a été conçu pour collecter et agréger les données de disponibilité des vaccins du système de vaccination de l'État de Californie (MyTurn), couvrant les 58 comtés.",
            "En utilisant CloudWatch, j'ai programmé un éventail déclenché par cron de tâches Lambda sans serveur pour collecter en parallèle les données de disponibilité de MyTurn. Une fonction Lambda séparée agrégeait les résultats et les stockait dans S3 comme un ensemble de données canonique unique.",
            "Il s'agissait d'une optimisation pour <notifier>Notifications de rendez-vous de vaccination</notifier> afin de réduire les appels directs à MyTurn et d'activer d'autres projets."
        ]
    },
    "home": {
        "title": "Devin Nguyen",
        "description": "Ingénieur logiciel",
        "intro": "Je suis un ingénieur logiciel full-stack basé à New York, construisant actuellement une infrastructure pour que les gouvernements et organisations à but non lucratif modernisent et étendent la prestation de prestations chez <aidkit>AidKit</aidkit>.",
        "background": "Auparavant, j'étais ingénieur logiciel principal chez <hypr>HYPR</hypr>, où j'ai construit une infrastructure d'authentification sans mot de passe de confiance pour les banques, universités et startups. Avant cela, j'étais membre technique senior du personnel chez <cloudhealth>CloudHealth</cloudhealth> by <vmware>VMware</vmware>, construisant des solutions pour la gouvernance cloud, l'optimisation des coûts et la conformité à l'échelle entreprise.",
        "links": {
            "bauhaus": "Leçons du Bauhaus",
            "bauhaus_photo": "Bauhäuslers",
            "ca_wildfire_mcp": "MCP : Cartographier les incendies de LA avec l'IA",
            "concerts": "Journal de concerts",
            "covid_appointments": "Notifications de rendez-vous COVID",
            "covid_myturn": "Moniteur COVID MyTurn CA",
            "discogs": "Discogs",
            "github": "GitHub",
            "la_main_ouverte": "La Main Ouverte",
            "linkedin": "LinkedIn",
            "live": "EN DIRECT",
            "se1": "(S)E1"
        },
        "sections": {
            "connect": "Se connecter",
            "photography": "Photographie",
            "writing": "Écriture"
        },
        "skipToContent": "Aller au contenu"
    },
    "laMainOuverte": {
        "title": "La Main Ouverte",
        "icon": "Symbole de La Main Ouverte en forme de main ouverte",
        "paragraphs": [
            "Située à seulement quelques heures au nord de New Delhi, Chandigarh est une ville planifiée née d'une collaboration inhabituelle avec un esprit ambitieux suite à l'indépendance de l'Inde. Après la partition de l'Inde en 1947, la province du Pendjab de l'Inde britannique fut divisée entre l'Inde et le Pakistan. Jawaharlal Nehru, le premier ministre de l'Inde, s'est lancé dans un effort conjoint avec Le Corbusier pour construire une ville utopique qui servirait de capitale partagée du Pendjab et de l'Haryana. C'est un paradis moderne et brutaliste qui fut achevé dans les années 1960 et était destiné à ouvrir la voie à un nouveau commencement radical pour l'Inde et était l'une des œuvres architecturales phares de Le Corbusier.",
            "La Main Ouverte était un motif récurrent dans l'œuvre de Le Corbusier et devint le symbole définitoire de Chandigarh."
        ],
        "attribution": "Le Corbusier",
        "pullquote": "« Elle tourne avec le vent, non pas sans but, mais pour exprimer ce qu'est vraiment la vie : le changement constant. La main est ouverte pour donner et recevoir. C'est un signe d'optimisme dans ce monde de catastrophe. »",
        "imageAlt": "Photographie {number} de la série d'architecture La Main Ouverte"
    },
    "mcpWildfire": {
        "title": "MCP : Cartographier les incendies de LA avec l'IA",
        "image": "Diagramme montrant les couches d'une carte avec une description de chaque couche (de bas en haut) : Carte de base de Los Angeles, Zone d'évacuation, Zone d'incendie actif, Évaluation des dommages et Photographies des dommages",
        "paragraphs": [
            "En réponse aux incendies de janvier 2025 à Los Angeles, <aidkit>AidKit</aidkit> s'est associé au comté de Los Angeles et à la ville de Los Angeles pour lancer rapidement deux programmes d'aide financière d'urgence.",
            "J'ai dirigé la conception et l'implémentation des nouvelles capacités géospatiales de la plateforme pour la réponse aux catastrophes. Cela incluait la construction d'un pipeline de synchronisation qui ingérait et normalisait les données des ensembles de données distants de parcelles fiscales et des données d'inspection des dommages de CAL FIRE, les stockant dans PostGIS pour les requêtes spatiales. Nous avons utilisé ces données pour trier automatiquement les candidats en fonction de l'impact au niveau de la parcelle, réduisant l'examen manuel et accélérant la livraison d'aide.",
            "J'ai également construit des cartes interactives en temps réel pour donner aux parties prenantes une visibilité en direct sur la portée du programme et la couverture d'éligibilité. Ces programmes ont finalement distribué plus de 25 millions de dollars d'aide directe aux particuliers et petites entreprises à travers Los Angeles.",
            "Ce projet m'a inspiré à explorer comment l'IA et les serveurs MCP peuvent accélérer l'administration des programmes. Par exemple, nous pourrions connecter un LLM aux données de dommages de CAL FIRE pour permettre une gamme plus large de flux de travail automatisés de triage et d'éligibilité."
        ],
        "readMore": "En savoir plus sur les programmes",
        "caseStudy": "Étude de cas AidKit",
        "award": "Prix Stevie 2025 pour l'excellence technologique",
        "routeFifty": "Route Fifty",
        "santaMonicaDailyPress": "Santa Monica Daily Press",
        "santaMonicaMirror": "Santa Monica Mirror",
        "secretLosAngeles": "Secret Los Angeles",
        "nbc": "NBC Los Angeles",
        "latimes": "Los Angeles Times",
        "lacounty": "County of Los Angeles",
        "github": {
            "sectionTitle": "Implémentation du serveur MCP",
            "linkTitle": "GitHub"
        }
    },
    "notFound": {
        "title": "404",
        "subtitle": "Page non trouvée",
        "message": "La page que vous recherchez n'existe pas.",
        "returnHome": "Retour à l'accueil"
    },
    "se1": {
        "title": "(S)E1",
        "paragraphs": [
            "Scènes de trajet à Londres de E1 à SE1"
        ],
        "imageAlt": "Photographie {number} de la collection de photographie argentique SE1"
    }
}