{
    "bauhaus": {
        "title": "Leçons du Bauhaus",
        "paragraphs": [
            "Au fil des années, j'ai présenté des variations de cette présentation à mes équipes, puisant l'inspiration du Bauhaus et de ses mouvements de design associés. La présentation décrit un cadre pour interpréter les tendances UI modernes et applique les principes et leçons du Bauhaus à la création de systèmes de design UI évolutifs et cohérents."
        ],
        "openPdfAriaLabel": "Ouvrir la présentation Leçons du Bauhaus PDF (s'ouvre dans un nouvel onglet)",
        "openPdfText": "Ouvrir PDF",
        "titleSlideAlt": "Leçons du Bauhaus - Diapositive de titre",
        "viewPresentationLink": "Voir la présentation complète (PDF)"
    },
    "bauhauslers": {
        "title": "Bauhäuslers",
        "paragraphs": [
            "Dans l'année du centenaire du Bauhaus, un voyage retraçant le chemin historique de l'école de Weimar en passant par Dessau jusqu'à Berlin.",
            "Bauhäusler — un étudiant du Bauhaus"
        ],
        "imageAlt": "Portrait {number} de la série photographique Bauhäuslers"
    },
    "clock": {
        "ariaLabel": "Heure actuelle à New York"
    },
    "common": {
        "index": "Index",
        "skipToContent": "Aller au contenu"
    },
    "theme": {
        "system": "défaut du système",
        "light": "mode clair",
        "dark": "mode sombre",
        "switchTo": "Changer vers {theme}",
        "currentMode": "Actuel : {mode}. Cliquez pour changer."
    },
    "concertLog": {
        "title": "Journal de concerts",
        "paragraphs": [
            "Une liste de concerts auxquels j'ai assisté.",
            "Composé en Times New Roman parce que IYKYK."
        ],
        "encore": "Rappel (dernier spectacle)",
        "indicator": "indique plusieurs spectacles",
        "live": "EN DIRECT",
        "loading": "Chargement",
        "search": "Rechercher"
    },
    "githubRepo": {
        "ariaLabel": "Ouvrir le dépôt {username}/{repoName} sur GitHub"
    },
    "covidAppointments": {
      "title": "Notifications de rendez-vous COVID",
      "image": "Graphique bannière avec le logo de Twilio et trois lignes pointant vers le logo. Le titre indique Recevoir des notifications de vaccin COVID-19 en utilisant les fonctions sans serveur Twilio.",
      "paragraphs": [
        "Ce projet était un système de notification automatisé qui intégrait Airtable et Twilio pour vous appeler lorsque des rendez-vous de vaccination COVID-19 devenaient disponibles. À l'époque, j'ai écrit des intégrations avec des systèmes en Californie, au Massachusetts et dans la ville de New York, ainsi qu'avec GetMyVaccine qui agrégeait les disponibilités de vaccins de CVS, Rite-Aid et Walgreens."      ],
      "setupGuide": "Guide de Configuration"
    },
    "covidMyturn": {
        "title": "Moniteur COVID MyTurn CA",
        "paragraphs": [
            "Ce projet a été conçu pour collecter et agréger les données de disponibilité des vaccins du système de vaccination de l'État de Californie (MyTurn), couvrant les 58 comtés.",
            "En utilisant CloudWatch, j'ai programmé un éventail déclenché par cron de tâches Lambda sans serveur pour collecter en parallèle les données de disponibilité de MyTurn. Une fonction Lambda séparée agrégeait les résultats et les stockait dans S3 comme un ensemble de données canonique unique.",
            "Il s'agissait d'une optimisation pour <notifier>Notifications de rendez-vous de vaccination</notifier> afin de réduire les appels directs à MyTurn et d'activer d'autres projets."
        ]
    },
    "homekitMagnepan": {
        "title": "Automatisation HomeKit pour Magnepans",
        "paragraphs": [
          "Voici un guide sur la façon dont j'ai configuré mes Magnepans pour que la lecture de vinyle et de streaming soit contrôlée via Apple HomeKit et les raccourcis iOS.",
          "![main]",
          "## Composants principaux",
          "![rel|magnepan]",
          "### Haut-parleurs et amplification",
          "- REL T/5x (subwoofer)",
          "- Magnepan LRS (haut-parleurs principaux)",
          "- Schiit Vidar (amplificateur de puissance)",
          "### Préamplification et sources",
          "- Schiit Modi (DAC)",
          "- Schiit Saga+ w/ tube Linlai E-6SN7 (préamplificateur)",
          "- Darlington Labs MP-7 (préamplificateur phono)",
          "### Sources",
          "- Sonos Port (streaming numérique, contrôle du système)",
          "- Platine vinyle Rega P6 w/ cellule ND7 MM",
          "### Connexions et contrôles",
          "- Câbles d'interconnexion RCA Snake Oil Taipan",
          "- Câbles d'enceintes Blue Jeans Cable Ten White 10AWG",
          "- Conditionneur d'alimentation Panamax Max 5510",
          "- Switchbot Hub 2 (émetteur IR)",
          "- Apple HomeKit via HomePod mini",
          "![panamax]",
          "## Contrôle du système avec Sonos Port",
          "Tout dans la configuration tourne autour de la sortie de déclenchement 12V du Sonos Port qui est connectée au conditionneur d'alimentation Panamax via un câble de déclenchement mono 3,5 mm. Lorsque le Sonos Port lit activement de la musique, le Panamax se réveille et allume toute la chaîne audio (préamplificateurs, amplificateur, subwoofer, etc.)",
          "Nous pouvons utiliser les automatisations HomeKit pour allumer et éteindre le système en lisant (ou en arrêtant) une bande sonore ambiante sur le Sonos Port.",
          "## Raccourcis iOS à configurer",
          "Les raccourcis iOS que nous allons configurer sont :",
          "- Raccourcis HomeKit : Allumer Magnepan, Éteindre Magnepan",
          "- Raccourcis Switchbot : Volume +, Volume -, Muet, Source suivante",
          "### Configuration de la scène HomeKit",
          "Créez une nouvelle scène qui lit de l'audio sur le haut-parleur Sonos Port (nommé Magnepan ici).",
          "![homekit1]",
          "Choisissez Lire l'audio puis sélectionnez un son. J'utilise les sons ambiants Apple comme Ocean car il se répète indéfiniment.",
          "![homekit2]",
          "## Contrôle du système avec Switchbot",
          "Avec le Hub Switchbot, vous pouvez lui apprendre les signaux IR de votre télécommande existante pour les rejouer à la demande. J'ai copié les signaux de la télécommande du Schiit Saga pour que le hub puisse contrôler la sélection de source et le volume.",
          "### Configuration de Switchbot",
          "Configurez la télécommande du Hub Switchbot et apprenez-lui les signaux IR de la télécommande de votre préamplificateur.",
          "![switchbot_pair|schiit_rc]",
          "Configurez des scènes rapides dans l'application Switchbot. Ayez une scène séparée pour Volume + et Volume - qui effectue une action via la télécommande Switchbot.",
          "![switchbot_quickscenes|switchbot_editscene]",
          "Une fois que vous avez configuré la scène rapide, ajoutez la scène rapide aux raccourcis Siri (cliquez sur Plus de moyens de déclencher et sélectionnez Raccourcis Siri).",
          "![switchbot_select|switchbot_siri]",
          "Nommez votre raccourci en conséquence.",
          "![heysiri]",
          "Une fois que vous l'avez soumis via l'application Switchbot, ouvrez l'application Raccourcis iOS et vous verrez un raccourci créé sous Tous les raccourcis ('Volume down' dans ce cas).",
          "![homekit_allshortcuts]",
          "### Aperçu analogique",
          "La lecture de vinyle ne réveille pas le système de manière inhérente. Même pendant la lecture de vinyle, le Sonos Port est intentionnellement maintenu éveillé avec une piste ambiante en boucle :",
          "- Le raccourci iOS démarre une piste ambiante en boucle sur le Sonos Port",
          "- Cela réveille le Sonos Port, qui émet un signal via le câble de déclenchement 12V vers Panamax",
          "- Panamax est activé avec le déclenchement 12V",
          "- Tout l'équipement analogique s'allume automatiquement",
          "- Saga+ est basculé sur l'entrée phono",
          "- Le vinyle joue via les haut-parleurs !",
          "#### Chemin analogique",
          "→ L'automatisation HomeKit lit les sons ambiants intégrés d'Apple sur le 'Haut-parleur' Sonos Port",
          "→ Le déclenchement 12V réveille le conditionneur d'alimentation Panamax qui allume tout le système",
          "→ La platine vinyle Rega P6 lit le disque",
          "→ Préamplificateur phono MP-7",
          "→ Préamplificateur Saga+ (réglé sur entrée phono — l'audio ambiant de Sonos maintient le système éveillé mais n'est pas entendu)",
          "→ Amplificateur Vidar",
          "→ Magnepan LRS + REL T/5X",
          "### Aperçu numérique",
          "La lecture numérique est simple : démarrez la musique sur le Sonos Port via AirPlay ou l'application Sonos, et le déclenchement 12V allume le système automatiquement. Tant que le Saga+ est réglé sur l'entrée DAC, la musique est diffusée vers les haut-parleurs.",
          "#### Chemin de streaming numérique",
          "→ Le 'Haut-parleur' Sonos Port lit activement de la musique depuis des plateformes de streaming numérique",
          "→ Le déclenchement 12V réveille le conditionneur d'alimentation Panamax qui allume tout le système",
          "→ DAC Schiit Modi",
          "→ Préamplificateur Saga+ (sélectionné sur source numérique)",
          "→ Amplificateur Vidar",
          "→ Magnepan LRS + REL T/5x",
          "---",
          "Avec cette configuration, je peux allumer et contrôler le système avec les raccourcis iOS. Étant donné que le Sonos Port n'émet un signal via le déclenchement DC 12V vers le conditionneur d'alimentation que pendant la lecture audio, le système s'éteindra automatiquement après un court délai une fois la lecture audio arrêtée. C'est tout !",
          "![video:record]",
          "P.S. Consultez ma collection de disques sur <discogs>Discogs</discogs> !"
        ],
        "images": {
            "main": "Platine vinyle Rega P6 avec disques vinyle sur étagère",
            "magnepan": "Haut-parleurs Magnepan LRS et subwoofer REL T/5x",
            "rel": "Subwoofer REL T/5x",
            "panamax": "Conditionneur d'alimentation Panamax Max 5510",
            "homekit1": "Configuration de nouvelle scène HomeKit avec haut-parleur Magnepan sélectionné",
            "homekit2": "Paramètres multimédia HomeKit montrant Lire l'audio avec le son ambiant Ocean sélectionné",
            "switchbot_pair": "Hub Switchbot apprenant les signaux IR de la télécommande",
            "schiit_rc": "Télécommande Schiit Saga",
            "switchbot_quickscenes": "Scènes rapides Switchbot montrant Sound down et Sound up",
            "switchbot_editscene": "Configuration d'édition de scène Switchbot pour contrôle du volume",
            "switchbot_siri": "Menu Plus de moyens de déclencher Switchbot et intégration des raccourcis Siri",
            "heysiri": "Animation de commande vocale Hey Siri pour Sound down",
            "switchbot_select": "Nommage du raccourci Siri pour scène Switchbot",
            "homekit_allshortcuts": "Application Raccourcis iOS montrant les raccourcis de contrôle du volume Magnepan"
        }
    },
    "home": {
        "title": "Devin Nguyen",
        "description": "Ingénieur logiciel",
        "intro": "Je suis un ingénieur logiciel full-stack basé à New York, construisant actuellement la plateforme d'automatisation intelligente pour les opérations de santé chez <tennr>Tennr</tennr>.",
        "previously": "Auparavant, j'étais ingénieur logiciel principal chez <aidkit>AidKit</aidkit>, où j'ai construit une infrastructure pour que les gouvernements et organisations à but non lucratif modernisent et étendent la prestation de prestations, et chez <hypr>HYPR</hypr>, où j'ai construit des solutions d'authentification sans mot de passe pour les institutions financières et les startups.",
        "before": "Avant cela, j'étais membre technique senior du personnel chez <cloudhealth>CloudHealth</cloudhealth> by <vmware>VMware</vmware>, construisant des solutions pour la gouvernance cloud, l'optimisation des coûts et la conformité à l'échelle entreprise.",
        "links": {
            "bauhaus": "Leçons du Bauhaus",
            "bauhaus_photo": "Bauhäuslers",
            "ca_wildfire_mcp": "MCP : Cartographier les incendies de LA avec l'IA",
            "concerts": "Journal de concerts",
            "covid_appointments": "Notifications de rendez-vous COVID",
            "covid_myturn": "Moniteur COVID MyTurn CA",
            "discogs": "Discogs",
            "github": "GitHub",
            "homekit_magnepan": "Automatisation HomeKit pour Magnepans",
            "la_main_ouverte": "La Main Ouverte",
            "linkedin": "LinkedIn",
            "live": "EN DIRECT",
            "se1": "(S)E1"
        },
        "sections": {
            "connect": "Se connecter",
            "photography": "Photographie",
            "writing": "Écriture"
        },
        "skipToContent": "Aller au contenu"
    },
    "laMainOuverte": {
        "title": "La Main Ouverte",
        "icon": "Symbole de La Main Ouverte en forme de main ouverte",
        "paragraphs": [
            "Située à seulement quelques heures au nord de New Delhi, Chandigarh est une ville planifiée née d'une collaboration inhabituelle avec un esprit ambitieux suite à l'indépendance de l'Inde. Après la partition de l'Inde en 1947, la province du Pendjab de l'Inde britannique fut divisée entre l'Inde et le Pakistan. Jawaharlal Nehru, le premier ministre de l'Inde, s'est lancé dans un effort conjoint avec Le Corbusier pour construire une ville utopique qui servirait de capitale partagée du Pendjab et de l'Haryana. C'est un paradis moderne et brutaliste qui fut achevé dans les années 1960 et était destiné à ouvrir la voie à un nouveau commencement radical pour l'Inde et était l'une des œuvres architecturales phares de Le Corbusier.",
            "La Main Ouverte était un motif récurrent dans l'œuvre de Le Corbusier et devint le symbole définitoire de Chandigarh."
        ],
        "attribution": "Le Corbusier",
        "pullquote": "« Elle tourne avec le vent, non pas sans but, mais pour exprimer ce qu'est vraiment la vie : le changement constant. La main est ouverte pour donner et recevoir. C'est un signe d'optimisme dans ce monde de catastrophe. »",
        "imageAlt": "Photographie {number} de la série d'architecture La Main Ouverte"
    },
    "mcpWildfire": {
        "title": "MCP : Cartographier les incendies de LA avec l'IA",
        "image": "Diagramme montrant les couches d'une carte avec une description de chaque couche (de bas en haut) : Carte de base de Los Angeles, Zone d'évacuation, Zone d'incendie actif, Évaluation des dommages et Photographies des dommages",
        "paragraphs": [
            "En réponse aux incendies de janvier 2025 à Los Angeles, <aidkit>AidKit</aidkit> s'est associé au comté de Los Angeles et à la ville de Los Angeles pour lancer rapidement deux programmes d'aide financière d'urgence.",
            "J'ai dirigé la conception et l'implémentation des nouvelles capacités géospatiales de la plateforme pour la réponse aux catastrophes. Cela incluait la construction d'un pipeline de synchronisation qui ingérait et normalisait les données des ensembles de données distants de parcelles fiscales et des données d'inspection des dommages de CAL FIRE, les stockant dans PostGIS pour les requêtes spatiales. Nous avons utilisé ces données pour trier automatiquement les candidats en fonction de l'impact au niveau de la parcelle, réduisant l'examen manuel et accélérant la livraison d'aide.",
            "J'ai également construit des cartes interactives en temps réel pour donner aux parties prenantes une visibilité en direct sur la portée du programme et la couverture d'éligibilité. Ces programmes ont finalement distribué plus de 25 millions de dollars d'aide directe aux particuliers et petites entreprises à travers Los Angeles.",
            "Ce projet m'a inspiré à explorer comment l'IA et les serveurs MCP peuvent accélérer l'administration des programmes. Par exemple, nous pourrions connecter un LLM aux données de dommages de CAL FIRE pour permettre une gamme plus large de flux de travail automatisés de triage et d'éligibilité."
        ],
        "readMore": "En savoir plus sur les programmes",
        "caseStudy": "Étude de cas AidKit",
        "award": "Prix Stevie 2025 pour l'excellence technologique",
        "routeFifty": "Route Fifty",
        "santaMonicaDailyPress": "Santa Monica Daily Press",
        "santaMonicaMirror": "Santa Monica Mirror",
        "secretLosAngeles": "Secret Los Angeles",
        "nbc": "NBC Los Angeles",
        "latimes": "Los Angeles Times",
        "lacounty": "County of Los Angeles",
        "github": {
            "sectionTitle": "Implémentation du serveur MCP",
            "linkTitle": "GitHub"
        }
    },
    "notFound": {
        "title": "404",
        "subtitle": "Page non trouvée",
        "message": "La page que vous recherchez n'existe pas.",
        "returnHome": "Retour à l'accueil"
    },
    "se1": {
        "title": "(S)E1",
        "paragraphs": [
            "Scènes de trajet à Londres de E1 à SE1"
        ],
        "imageAlt": "Photographie {number} de la collection de photographie argentique SE1"
    }
}