{
    "bauhaus": {
        "title": "बाउहाउस से सीख",
        "paragraphs": [
            "वर्षों से, मैंने अपनी टीमों को इस वार्ता के विभिन्न रूप प्रस्तुत किए हैं ताकि बाउहाउस और इसके संबंधित आंदोलनों से प्रेरणा ली जा सके और वर्तमान UI रुझानों को समझने और UI डिज़ाइन सिस्टम बनाने के लिए बाउहाउस से सीख लागू करने का एक ढांचा प्रस्तावित किया जा सके।"
        ],
        "openPdfAriaLabel": "बाउहाउस से सीख प्रेजेंटेशन PDF खोलें (नए टैब में खुलता है)",
        "openPdfText": "PDF खोलें ↗",
        "titleSlideAlt": "बाउहाउस से सीख - शीर्षक स्लाइड",
        "viewPresentationLink": "पूरी प्रेजेंटेशन देखें (PDF)"
    },
    "bauhauslers": {
        "title": "Bauhäuslers",
        "paragraphs": [
            "वीमर से डेसाऊ होते हुए बर्लिन तक की यात्रा, बाउहाउस के शताब्दी समारोह के दौरान इसके पथ का अनुसरण करते हुए।",
            "Bauhäusler — बाउहाउस का एक छात्र",
            "Mieslinge — मास्टर मीस वैन डेर रोहे की नकल करने वाले छात्रों के लिए अपमानजनक शब्द; \"Mies\" और जर्मन \"misslingen\" [असफलता] से"
        ]
    },
    "common": {
        "index": "सूची"
    },
    "concertLog": {
        "title": "संगीत समारोह डायरी",
        "paragraphs": [
            "उपस्थित संगीत समारोहों की सूची।",
            "Times New Roman में सेट किया गया क्योंकि IYKYK।"
        ],
        "encore": "एन्कोर (अंतिम शो)",
        "indicator": "कई शो को दर्शाता है",
        "live": "लाइव",
        "loading": "लोड हो रहा है",
        "search": "खोजें"
    },
    "covidAppointments": {
        "title": "COVID अपॉइंटमेंट सूचनाएं",
        "image": "Twilio के लोगो के साथ बैनर ग्राफिक और तीन लाइनें लोगो की ओर इशारा करती हुई। शीर्षक कहता है Twilio Serverless Functions का उपयोग करके COVID-19 वैक्सीन सूचनाएं प्राप्त करें।",
        "paragraphs": [
            "यह Airtable और Twilio को एकीकृत करने का एक प्रोजेक्ट था ताकि जब वैक्सीनेशन अपॉइंटमेंट उपलब्ध हो जाए तो आपको कॉल किया जा सके। उस समय, मैंने कैलिफ़ोर्निया, मैसाचुसेट्स और न्यूयॉर्क सिटी में सिस्टमों के साथ-साथ GetMyVaccine के साथ इंटीग्रेशन लिखे थे जो CVS, Rite-Aid और Walgreens में वैक्सीन उपलब्धता को एकत्रित करता था।",
            "<github>वैक्सीन अपॉइंटमेंट सूचनाएं ↗</github>"
        ]
    },
    "covidMyturn": {
        "title": "COVID MyTurn CA मॉनिटर",
        "paragraphs": [
            "यह कैलिफ़ोर्निया राज्य वैक्सीनेशन सिस्टम (MyTurn) से सभी 58 काउंटियों के लिए वैक्सीन उपलब्धता डेटा एकत्रित और एकीकृत करने का एक प्रोजेक्ट था।",
            "<github>MyTurn मॉनिटर ↗</github>"
        ]
    },
    "home": {
        "title": "Devin Nguyen",
        "description": "सॉफ्टवेयर इंजीनियर",
        "intro": "मैं NYC में स्थित एक फुल-स्टैक सॉफ्टवेयर इंजीनियर हूं, वर्तमान में <aidkit>AidKit</aidkit> में प्रत्यक्ष नकद सहायता कार्यक्रम बना रहा हूं।",
        "background": "पहले, मैं <hypr>HYPR</hypr> में प्रिंसिपल सॉफ्टवेयर इंजीनियर था जो बैंकों, विश्वविद्यालयों और स्टार्टअप्स के लिए स्केलेबल पासवर्ड रहित सिस्टम बना रहा था। उससे पहले, मैं <vmware>VMware</vmware> के <cloudhealth>CloudHealth</cloudhealth> में सीनियर मेंबर ऑफ टेक्निकल स्टाफ था, जो क्लाउड इन्फ्रास्ट्रक्चर प्रबंधन के लिए एक प्लेटफॉर्म है।",
        "links": {
            "bauhaus": "बाउहाउस से सीख",
            "bauhaus_photo": "Bauhäuslers",
            "ca_wildfire_mcp": "MCP: AI के साथ LA जंगली आग का मैपिंग",
            "concerts": "संगीत समारोह डायरी",
            "covid_appointments": "COVID अपॉइंटमेंट सूचनाएं",
            "covid_myturn": "COVID MyTurn CA मॉनिटर",
            "discogs": "Discogs",
            "github": "GitHub",
            "la_main_ouverte": "La Main Ouverte",
            "linkedin": "LinkedIn",
            "live": "लाइव",
            "se1": "(S)E1"
        },
        "sections": {
            "connect": "जुड़ें",
            "photography": "फोटोग्राफी",
            "writing": "लेखन"
        }
    },
    "laMainOuverte": {
        "title": "La Main Ouverte",
        "icon": "खुले हाथ के आकार में La Main Ouverte प्रतीक",
        "paragraphs": [
            "नई दिल्ली के उत्तर में केवल कुछ घंटों की दूरी पर स्थित, चंडीगढ़ एक नियोजित शहर है जो भारत की स्वतंत्रता के बाद एक महत्वाकांक्षी भावना के साथ एक असामान्य सहयोग से जन्मा है। 1947 में भारत के विभाजन के बाद, ब्रिटिश भारत का पंजाब प्रांत भारत और पाकिस्तान के बीच विभाजित हो गया था। जवाहरलाल नेहरू, भारत के पहले प्रधानमंत्री ने ले कॉर्बुज़िए के साथ एक संयुक्त प्रयास शुरू किया था ताकि एक आदर्श शहर का निर्माण किया जा सके जो पंजाब और हरियाणा की साझा राजधानी के रूप में काम करे। यह एक आधुनिक, ब्रूटलिस्ट स्वर्ग है जो 1960 के दशक में पूरा हुआ था और भारत के लिए एक कट्टरपंथी नई शुरुआत का मंच तैयार करने का इरादा था और ले कॉर्बुज़िए के वास्तुकला में महत्वपूर्ण कार्यों में से एक था।",
            "खुला हाथ, या La Main Ouverte, ले कॉर्बुज़िए के काम में एक आवर्ती रूपांकन था और चंडीगढ़ का परिभाषित प्रतीक बन गया।"
        ],
        "attribution": "ले कॉर्बुज़िए",
        "pullquote": "\"यह हवा के साथ घूमता है, बेमकसद नहीं, बल्कि यह व्यक्त करने के लिए कि जीवन वास्तव में क्या है: निरंतर परिवर्तन। हाथ देने और प्राप्त करने के लिए खुला है। यह इस आपदा की दुनिया में आशावाद का संकेत है।\""
    },
    "mcpWildfire": {
        "title": "MCP: AI के साथ LA जंगली आग का मैपिंग",
        "image": "मानचित्र की परतों को दिखाने वाला आरेख जिसमें प्रत्येक परत का विवरण है (नीचे से ऊपर तक): लॉस एंजिल्स का आधार मानचित्र, निकासी क्षेत्र, सक्रिय आग क्षेत्र, क्षति मूल्यांकन, और क्षति की तस्वीरें",
        "paragraphs": [
            "लॉस एंजिल्स में जनवरी 2025 की जंगली आग के जवाब में, <aidkit>AidKit</aidkit> ने तुरंत लॉस एंजिल्स काउंटी और लॉस एंजिल्स शहर के साथ साझेदारी की ताकि लक्षित आपातकालीन आपदा नकद सहायता राहत प्रदान करने वाले दो कार्यक्रम शुरू किए जा सकें।",
            "मैंने आपातकालीन प्रतिक्रिया के लिए प्लेटफॉर्म की नई भू-स्थानिक क्षमताओं के कार्यान्वयन का नेतृत्व किया, जिसमें कर पार्सल और CAL FIRE डेटा के साथ GIS डेटा एकीकरण शामिल है। मैंने रियल-टाइम मैपिंग विज़ुअलाइज़ेशन भी बनाए ताकि सभी हितधारक कार्यक्रमों के प्रभाव और पहुंच पर अद्यतित रह सकें। इन कार्यक्रमों ने LA में व्यक्तियों और छोटे व्यवसायों को $25M से अधिक की सहायता वितरित की।",
            "आप कार्यक्रमों के बारे में यहां और पढ़ सकते हैं:",
            "<casestudy>लॉस एंजिल्स क्षेत्रीय जंगली आग राहत कार्यक्रम</casestudy>",
            "<award>AidKit को तकनीकी उत्कृष्टता के लिए 2025 स्टीवी पुरस्कार में विजेता नामित किया गया</award>",
            "मैं यह देखकर प्रेरित हुआ कि AI और MCP सर्वर का उपयोग तेज़ कार्यक्रम प्रशासन को सक्षम करने और व्यापक कार्यप्रवाह की अनुमति देने के लिए CAL FIRE के क्षति निरीक्षण डेटा के साथ LLM को जोड़ने के लिए कैसे किया जा सकता है।",
            "इसका एक उदाहरण सर्वर यहां पाया जा सकता है:",
            "<repo>CAL FIRE DINS ArcGIS MCP Server ↗</repo>"
        ]
    },
    "notFound": {
        "title": "404",
        "subtitle": "पृष्ठ नहीं मिला",
        "message": "आप जो पृष्ठ खोज रहे हैं वह मौजूद नहीं है।",
        "returnHome": "होम पर वापस जाएं"
    },
    "se1": {
        "title": "(S)E1",
        "paragraphs": [
            "लंदन में E1 से SE1 तक के यात्रा दृश्य"
        ]
    }
}