{
    "bauhaus": {
        "title": "बाउहाउस से सीख",
        "paragraphs": [
            "वर्षों से, मैंने अपनी टीमों को इस वार्ता के विभिन्न रूप प्रस्तुत किए हैं ताकि बाउहाउस और इसके संबंधित आंदोलनों से प्रेरणा ली जा सके और वर्तमान UI रुझानों को समझने और UI डिज़ाइन सिस्टम बनाने के लिए बाउहाउस से सीख लागू करने का एक ढांचा प्रस्तावित किया जा सके।"
        ],
        "openPdfAriaLabel": "बाउहाउस से सीख प्रेजेंटेशन PDF खोलें (नए टैब में खुलता है)",
        "openPdfText": "PDF खोलें",
        "titleSlideAlt": "बाउहाउस से सीख - शीर्षक स्लाइड",
        "viewPresentationLink": "पूरी प्रेजेंटेशन देखें (PDF)"
    },
    "bauhauslers": {
        "title": "Bauhäuslers",
        "paragraphs": [
            "बाउहाउस आंदोलन के ऐतिहासिक पथ का अनुसरण करती हुई एक यात्रा वीमर से डेसाऊ होते हुए बर्लिन तक शताब्दी समारोह के दौरान।",
            "Bauhäusler — बाउहाउस का एक छात्र",
            "Mieslinge — मास्टर मीस वैन डेर रोहे की नकल करने वाले छात्रों के लिए अपमानजनक शब्द; \"Mies\" और जर्मन \"misslingen\" [असफलता] से"
        ],
        "imageAlt": "Bauhäuslers फोटोग्राफी श्रृंखला से चित्र {number}"
    },
    "common": {
        "index": "सूची",
        "skipToContent": "सामग्री पर जाएं"
    },
    "theme": {
        "system": "सिस्टम थीम",
        "light": "हल्का मोड",
        "dark": "गहरा मोड",
        "switchTo": "{theme} पर स्विच करें",
        "currentMode": "वर्तमान: {mode}। स्विच करने के लिए क्लिक करें।"
    },
    "concertLog": {
        "title": "संगीत समारोह डायरी",
        "paragraphs": [
            "उपस्थित संगीत समारोहों की सूची।",
            "Times New Roman में सेट किया गया क्योंकि IYKYK।"
        ],
        "encore": "एन्कोर (अंतिम शो)",
        "indicator": "कई शो को दर्शाता है",
        "live": "लाइव",
        "loading": "लोड हो रहा है",
        "search": "खोजें"
    },
    "covidAppointments": {
        "title": "COVID अपॉइंटमेंट सूचनाएं",
        "image": "Twilio के लोगो के साथ बैनर ग्राफिक और तीन लाइनें लोगो की ओर इशारा करती हुई। शीर्षक कहता है Twilio Serverless Functions का उपयोग करके COVID-19 वैक्सीन सूचनाएं प्राप्त करें।",
        "paragraphs": [
            "यह प्रोजेक्ट एक स्वचालित सूचना प्रणाली थी जो Airtable और Twilio को एकीकृत करती थी ताकि जब COVID-19 वैक्सीन अपॉइंटमेंट उपलब्ध हों तो आपको कॉल किया जा सके। उस समय, मैंने कैलिफ़ोर्निया, मैसाचुसेट्स और न्यूयॉर्क सिटी में सिस्टमों के साथ-साथ GetMyVaccine के साथ इंटीग्रेशन लिखे थे जो CVS, Rite-Aid और Walgreens से वैक्सीन उपलब्धता को एकत्रित करता था।",
            "<github>वैक्सीन अपॉइंटमेंट सूचनाएं</github>"
        ]
    },
    "covidMyturn": {
        "title": "COVID MyTurn CA मॉनिटर",
        "paragraphs": [
            "यह प्रोजेक्ट कैलिफ़ोर्निया राज्य वैक्सीनेशन सिस्टम (MyTurn) से सभी 58 काउंटियों के लिए वैक्सीन उपलब्धता डेटा एकत्रित और एकीकृत करने के लिए बनाया गया था।",
            "CloudWatch का उपयोग करके, मैंने MyTurn से समानांतर में उपलब्धता डेटा एकत्रित करने के लिए cron-triggered serverless Lambda jobs का एक fan-out शेड्यूल किया। एक अलग Lambda function परिणामों को एकत्रित करता था और उन्हें S3 में एक एकल canonical dataset के रूप में संग्रहीत करता था।",
            "यह <notifier>वैक्सीन अपॉइंटमेंट सूचनाएं</notifier> के लिए एक अनुकूलन था ताकि MyTurn के प्रत्यक्ष कॉल को कम किया जा सके और अन्य प्रोजेक्ट्स को सक्षम किया जा सके।",
            "<github>MyTurn मॉनिटर</github>"
        ]
    },
    "home": {
        "title": "Devin Nguyen",
        "description": "सॉफ्टवेयर इंजीनियर",
        "intro": "मैं NYC में स्थित एक फुल-स्टैक सॉफ्टवेयर इंजीनियर हूं, वर्तमान में <aidkit>AidKit</aidkit> में सरकारों और गैर-लाभकारी संगठनों के लिए benefits delivery को आधुनिक बनाने और स्केल करने के लिए infrastructure बना रहा हूं।",
        "background": "पहले, मैं <hypr>HYPR</hypr> में प्रिंसिपल सॉफ्टवेयर इंजीनियर था, जहां मैंने बैंकों, विश्वविद्यालयों और स्टार्टअप्स के लिए विश्वसनीय passwordless authentication infrastructure बनाया। उससे पहले, मैं <vmware>VMware</vmware> के <cloudhealth>CloudHealth</cloudhealth> में सीनियर मेंबर ऑफ टेक्निकल स्टाफ था, जहां मैंने enterprise scale पर cloud governance, cost optimization, और compliance के लिए solutions बनाए।",
        "links": {
            "bauhaus": "बाउहाउस से सीख",
            "bauhaus_photo": "Bauhäuslers",
            "ca_wildfire_mcp": "MCP: AI के साथ LA जंगली आग का मैपिंग",
            "concerts": "संगीत समारोह डायरी",
            "covid_appointments": "COVID अपॉइंटमेंट सूचनाएं",
            "covid_myturn": "COVID MyTurn CA मॉनिटर",
            "discogs": "Discogs",
            "github": "GitHub",
            "la_main_ouverte": "La Main Ouverte",
            "linkedin": "LinkedIn",
            "live": "लाइव",
            "se1": "(S)E1"
        },
        "sections": {
            "connect": "जुड़ें",
            "photography": "फोटोग्राफी",
            "writing": "लेखन"
        },
        "skipToContent": "सामग्री पर जाएं"
    },
    "laMainOuverte": {
        "title": "La Main Ouverte",
        "icon": "खुले हाथ के आकार में La Main Ouverte प्रतीक",
        "paragraphs": [
            "नई दिल्ली के उत्तर में केवल कुछ घंटों की दूरी पर स्थित, चंडीगढ़ एक नियोजित शहर है जो भारत की स्वतंत्रता के बाद एक महत्वाकांक्षी भावना के साथ एक असामान्य सहयोग से जन्मा है। 1947 में भारत के विभाजन के बाद, ब्रिटिश भारत का पंजाब प्रांत भारत और पाकिस्तान के बीच विभाजित हो गया था। जवाहरलाल नेहरू, भारत के पहले प्रधानमंत्री ने ले कॉर्बुज़िए के साथ एक संयुक्त प्रयास शुरू किया था ताकि एक आदर्श शहर का निर्माण किया जा सके जो पंजाब और हरियाणा की साझा राजधानी के रूप में काम करे। यह एक आधुनिक, ब्रूटलिस्ट स्वर्ग है जो 1960 के दशक में पूरा हुआ था और भारत के लिए एक कट्टरपंथी नई शुरुआत का मंच तैयार करने का इरादा था और ले कॉर्बुज़िए के वास्तुकला में महत्वपूर्ण कार्यों में से एक था।",
            "खुला हाथ, या La Main Ouverte, ले कॉर्बुज़िए के काम में एक आवर्ती रूपांकन था और चंडीगढ़ का परिभाषित प्रतीक बन गया।"
        ],
        "attribution": "ले कॉर्बुज़िए",
        "pullquote": "\"यह हवा के साथ घूमता है, बेमकसद नहीं, बल्कि यह व्यक्त करने के लिए कि जीवन वास्तव में क्या है: निरंतर परिवर्तन। हाथ देने और प्राप्त करने के लिए खुला है। यह इस आपदा की दुनिया में आशावाद का संकेत है।\"",
        "imageAlt": "La Main Ouverte आर्किटेक्चर श्रृंखला से फोटोग्राफ {number}"
    },
    "mcpWildfire": {
        "title": "MCP: AI के साथ LA जंगली आग का मैपिंग",
        "image": "मानचित्र की परतों को दिखाने वाला आरेख जिसमें प्रत्येक परत का विवरण है (नीचे से ऊपर तक): लॉस एंजिल्स का आधार मानचित्र, निकासी क्षेत्र, सक्रिय आग क्षेत्र, क्षति मूल्यांकन, और क्षति की तस्वीरें",
        "paragraphs": [
            "लॉस एंजिल्स में जनवरी 2025 की जंगली आग के जवाब में, <aidkit>AidKit</aidkit> ने लॉस एंजिल्स काउंटी और लॉस एंजिल्स शहर के साथ साझेदारी की ताकि तुरंत दो आपातकालीन नकद राहत कार्यक्रम शुरू किए जा सकें।",
            "मैंने आपदा प्रतिक्रिया के लिए प्लेटफॉर्म की नई भू-स्थानिक क्षमताओं के डिज़ाइन और कार्यान्वयन का नेतृत्व किया। इसमें एक sync pipeline का निर्माण शामिल था जो remote tax parcel datasets और CAL FIRE damage inspection data से डेटा ingest और normalize करती थी, इसे PostGIS में spatial queries के लिए store करती थी। हमने इस डेटा का उपयोग parcel-level impact के आधार पर applicants को automatically qualify करने के लिए किया, manual review को कम करके aid delivery को तेज़ बनाया।",
            "मैंने stakeholders को program reach और eligibility coverage पर live visibility देने के लिए real-time, interactive maps भी बनाए। इन कार्यक्रमों ने अंततः लॉस एंजिल्स में व्यक्तियों और छोटे व्यवसायों को $25M से अधिक का प्रत्यक्ष सहायता वितरित किया।",
            "इस प्रोजेक्ट ने मुझे यह explore करने के लिए प्रेरित किया कि AI और MCP servers कैसे program administration को accelerate कर सकते हैं। उदाहरण के लिए, हम CAL FIRE के damage data के साथ LLM को connect कर सकते हैं ताकि automated triage और eligibility workflows की एक व्यापक रेंज enable हो सके।",
            "यहां एक example server implementation है:",
            "<repo>CAL FIRE DINS ArcGIS MCP Server</repo>",
            "आप कार्यक्रमों के बारे में यहां और पढ़ सकते हैं:",
            "<casestudy>AidKit Case Study: लॉस एंजिल्स Regional Wildfire Relief Programs</casestudy>",
            "<award>AidKit को Technology Excellence के लिए 2025 Stevie Awards में Winner नामित किया गया</award>",
            "<press>Route Fifty: कैसे LA wildfire victims को financial help देने के लिए tech का उपयोग कर रहा है</press>",
            "<press3>Santa Monica Daily Press: LA County ने Malibu-Topanga Businesses के लिए $250,000 Grant Program launch किया</press3>",
            "<press2>Secret Los Angeles: L.A. County ने wildfires से प्रभावित Small Businesses की मदद के लिए नया $250,000 Grant launch किया</press2>"
        ]
    },
    "notFound": {
        "title": "404",
        "subtitle": "पृष्ठ नहीं मिला",
        "message": "आप जो पृष्ठ खोज रहे हैं वह मौजूद नहीं है।",
        "returnHome": "होम पर वापस जाएं"
    },
    "se1": {
        "title": "(S)E1",
        "paragraphs": [
            "लंदन में E1 से SE1 तक के यात्रा दृश्य"
        ],
        "imageAlt": "SE1 film photography collection से फोटोग्राफ {number}"
    }
}