{
    "bauhaus": {
        "title": "Bài học từ Bauhaus",
        "paragraphs": [
            "Qua nhiều năm, tôi đã trình bày các phiên bản khác nhau của bài thuyết trình này cho các nhóm của mình để lấy cảm hứng từ Bauhaus và các phong trào liên quan, đồng thời đề xuất một khung để hiểu các xu hướng UI hiện tại và áp dụng các bài học từ Bauhaus vào việc xây dựng hệ thống thiết kế UI."
        ],
        "openPdfAriaLabel": "Mở bài thuyết trình Bài học từ Bauhaus PDF (mở trong tab mới)",
        "openPdfText": "Mở PDF",
        "titleSlideAlt": "Bài học từ Bauhaus - Slide tiêu đề",
        "viewPresentationLink": "Xem bài thuyết trình đầy đủ (PDF)"
    },
    "bauhauslers": {
        "title": "Bauhäuslers",
        "paragraphs": [
            "Một chuyến hành theo dấu vết lịch sử của phong trào Bauhaus từ Weimar đến Dessau rồi đến Berlin trong dịp kỷ niệm 100 năm.",
            "Bauhäusler — một học sinh của Bauhaus"
        ],
        "imageAlt": "Chân dung {number} từ bộ sưu tập ảnh Bauhäuslers"
    },
    "clock": {
        "ariaLabel": "Đồng hồ hiển thị {time} ET"
    },
    "common": {
        "index": "Mục lục",
        "skipToContent": "Chuyển đến nội dung"
    },
    "theme": {
        "system": "mặc định hệ thống",
        "light": "Chế độ sáng",
        "dark": "Chế độ tối",
        "switchTo": "Chuyển sang {theme}",
        "currentMode": "Hiện tại: {mode}. Nhấp để chuyển đổi."
    },
    "concertLog": {
        "title": "Nhật ký hòa nhạc",
        "paragraphs": [
            "Danh sách các buổi hòa nhạc đã tham dự.",
            "Được thiết lập bằng Times New Roman vì IYKYK."
        ],
        "encore": "Encore (buổi diễn cuối)",
        "indicator": "cho biết nhiều buổi diễn",
        "live": "TRỰC TIẾP",
        "loading": "Đang tải",
        "search": "Tìm kiếm"
    },
    "covidAppointments": {
        "title": "Thông báo lịch hẹn COVID",
        "image": "Đồ họa banner với logo Twilio và ba đường thẳng chỉ về phía logo. Tiêu đề ghi Nhận thông báo vaccine COVID-19 bằng cách sử dụng Twilio Serverless Functions.",
        "paragraphs": [
            "Đây là một hệ thống thông báo tự động tích hợp Airtable và Twilio để gọi cho bạn khi có lịch hẹn tiêm vaccine COVID-19. Vào thời điểm đó, tôi đã viết các tích hợp với các hệ thống ở California, Massachusetts và thành phố New York, cũng như GetMyVaccine nơi tổng hợp tình trạng sẵn có của vaccine từ CVS, Rite-Aid và Walgreens.",
            "<github>Thông báo lịch hẹn vaccine</github>"
        ]
    },
    "covidMyturn": {
        "title": "Trình giám sát COVID MyTurn CA",
        "paragraphs": [
            "Dự án này được xây dựng để thu thập và tổng hợp dữ liệu về tình trạng sẵn có của vaccine từ hệ thống tiêm chủng của bang California (MyTurn), bao gồm tất cả 58 quận.",
            "Sử dụng CloudWatch, tôi đã lên lịch một fan-out được kích hoạt bằng cron của các công việc Lambda serverless để thu thập dữ liệu tính sẵn có từ MyTurn song song. Một hàm Lambda riêng biệt đã tổng hợp kết quả và lưu trữ chúng trong S3 như một bộ dữ liệu chuẩn duy nhất.",
            "Đây là một tối ưu hóa cho <notifier>Thông báo lịch hẹn vaccine</notifier> để giảm các cuộc gọi trực tiếp đến MyTurn và cho phép các dự án khác.",
            "<github>Trình giám sát MyTurn</github>"
        ]
    },
    "home": {
        "title": "Devin Nguyen",
        "description": "Kỹ sư phần mềm",
        "intro": "Tôi là một kỹ sư phần mềm full-stack có trụ sở tại New York City, hiện đang xây dựng cơ sở hạ tầng cho các chính phủ và tổ chức phi lợi nhuận hiện đại hóa và mở rộng việc cung cấp quyền lợi tại <aidkit>AidKit</aidkit>.",
        "background": "Trước đây, tôi là Kỹ sư phần mềm chính tại <hypr>HYPR</hypr>, nơi tôi đã xây dựng cơ sở hạ tầng xác thực không mật khẩu đáng tin cậy cho các ngân hàng, trường đại học và startup. Trước đó, tôi là Thành viên kỹ thuật cấp cao tại <cloudhealth>CloudHealth</cloudhealth> của <vmware>VMware</vmware>, xây dựng các giải pháp cho quản trị đám mây, tối ưu hóa chi phí và tuân thủ quy định ở quy mô doanh nghiệp.",
        "links": {
            "bauhaus": "Bài học từ Bauhaus",
            "bauhaus_photo": "Bauhäuslers",
            "ca_wildfire_mcp": "MCP: Lập bản đồ cháy rừng LA với AI",
            "concerts": "Nhật ký hòa nhạc",
            "covid_appointments": "Thông báo lịch hẹn COVID",
            "covid_myturn": "Trình giám sát COVID MyTurn CA",
            "discogs": "Discogs",
            "github": "GitHub",
            "la_main_ouverte": "La Main Ouverte",
            "linkedin": "LinkedIn",
            "live": "TRỰC TIẾP",
            "se1": "(S)E1"
        },
        "sections": {
            "connect": "Kết nối",
            "photography": "Nhiếp ảnh",
            "writing": "Viết lách"
        },
        "skipToContent": "Chuyển đến nội dung"
    },
    "laMainOuverte": {
        "title": "La Main Ouverte",
        "icon": "Biểu tượng La Main Ouverte có hình dạng bàn tay mở",
        "paragraphs": [
            "Nằm chỉ vài giờ về phía bắc New Delhi, Chandigarh là một thành phố được quy hoạch ra đời từ một sự hợp tác bất thường với tinh thần đầy tham vọng sau khi Ấn Độ độc lập. Sau cuộc phân chia Ấn Độ năm 1947, tỉnh Punjab của Ấn Độ thuộc Anh được chia giữa Ấn Độ và Pakistan. Jawaharlal Nehru, Thủ tướng đầu tiên của Ấn Độ, đã bắt tay vào một nỗ lực chung với Le Corbusier để xây dựng một thành phố utopia sẽ đóng vai trò là thủ đô chung của Punjab và Haryana. Đó là một thiên đường hiện đại, theo trường phái Brutalist được hoàn thành vào những năm 1960 và nhằm mục đích tạo tiền đề cho một khởi đầu mới triệt để cho Ấn Độ và là một trong những tác phẩm kiến trúc tinh hoa của Le Corbusier.",
            "Bàn tay mở, hay La Main Ouverte, là một chủ đề lặp đi lặp lại trong tác phẩm của Le Corbusier và trở thành biểu tượng đặc trưng của Chandigarh."
        ],
        "attribution": "Le Corbusier",
        "pullquote": "\"Nó quay theo gió, không phải một cách vô mục đích, mà để thể hiện cuộc sống thực sự là gì: sự thay đổi liên tục. Bàn tay mở để cho và nhận. Đó là một dấu hiệu của sự lạc quan trong thế giới thảm họa này.\"",
        "imageAlt": "Ảnh {number} từ bộ sưu tập kiến trúc La Main Ouverte"
    },
    "mcpWildfire": {
        "title": "MCP: Lập bản đồ cháy rừng LA với AI",
        "image": "Sơ đồ hiển thị các lớp của bản đồ với mô tả từng lớp (từ dưới lên trên): Bản đồ cơ sở Los Angeles, Khu vực sơ tán, Khu vực cháy đang hoạt động, Đánh giá thiệt hại và Ảnh thiệt hại",
        "paragraphs": [
            "Để ứng phó với các vụ cháy rừng tháng 1 năm 2025 tại Los Angeles, <aidkit>AidKit</aidkit> đã hợp tác với Quận Los Angeles và Thành phố Los Angeles để nhanh chóng khởi động hai chương trình cứu trợ tiền mặt khẩn cấp.",
            "Tôi đã dẫn dắt thiết kế và triển khai các khả năng không gian địa lý mới của nền tảng cho ứng phó thảm họa. Điều này bao gồm xây dựng một pipeline đồng bộ hóa để thu thập và chuẩn hóa dữ liệu từ các bộ dữ liệu thửa đất thuế từ xa và dữ liệu kiểm tra thiệt hại CAL FIRE, lưu trữ chúng trong PostGIS cho các truy vấn không gian. Chúng tôi đã sử dụng dữ liệu này để tự động đủ điều kiện cho các ứng viên dựa trên tác động ở cấp độ thửa đất, giảm việc xem xét thủ công và tăng tốc việc giao hàng trợ giúp.",
            "Tôi cũng đã xây dựng các bản đồ tương tác thời gian thực để cung cấp cho các bên liên quan khả năng hiển thị trực tiếp về phạm vi chương trình và phạm vi đủ điều kiện. Cuối cùng, những chương trình này đã phân phối hơn 25 triệu đô la viện trợ trực tiếp cho các cá nhân và doanh nghiệp nhỏ trên khắp Los Angeles.",
            "Dự án này đã truyền cảm hứng cho tôi khám phá cách AI và các máy chủ MCP có thể tăng tốc việc quản lý chương trình. Ví dụ, chúng tôi có thể kết nối LLM với dữ liệu thiệt hại CAL FIRE để cho phép một loạt các quy trình làm việc phân loại và đủ điều kiện tự động rộng hơn.",
            "Đây là một ví dụ về triển khai máy chủ:",
            "<repo>Máy chủ MCP CAL FIRE DINS ArcGIS</repo>",
            "Bạn có thể đọc thêm về các chương trình tại đây:",
            "<casestudy>Nghiên cứu trường hợp AidKit: Chương trình cứu trợ cháy rừng khu vực Los Angeles</casestudy>",
            "<award>AidKit được vinh danh là người chiến thắng tại Giải thưởng Stevie 2025 cho Xuất sắc Công nghệ</award>",
            "<press>Route Fifty: Cách LA đang sử dụng công nghệ để giúp nạn nhân cháy rừng về tài chính</press>",
            "<press3>Santa Monica Daily Press: Quận LA khởi động chương trình tài trợ 250.000 đô la cho các doanh nghiệp Malibu-Topanga</press3>",
            "<press2>Secret Los Angeles: Quận L.A. khởi động khoản tài trợ mới 250.000 đô la để giúp các doanh nghiệp nhỏ bị ảnh hưởng bởi cháy rừng</press2>"
        ]
    },
    "notFound": {
        "title": "404",
        "subtitle": "Không tìm thấy trang",
        "message": "Trang bạn đang tìm kiếm không tồn tại.",
        "returnHome": "Về trang chủ"
    },
    "se1": {
        "title": "(S)E1",
        "paragraphs": [
            "Cảnh đi lại ở London từ E1 đến SE1"
        ],
        "imageAlt": "Ảnh {number} từ bộ sưu tập nhiếp ảnh phim SE1"
    }
}