{
  "ddxdevin.languages.en": "anglais",
  "ddxdevin.languages.fr": "français",
  "ddxdevin.languages.change": "Change la language en {language}",
  "ddxdevin.index": "Index",
  "ddxdevin.home.title": "Devin Nguyen.Accueil",
  "ddxdevin.work.role.principal": "Ingénieur principal chez",
  "ddxdevin.work.role.previous": "Précédemment",
  "ddxdevin.work.role.software": "Développeur chez",
  "ddxdevin.work.role.cht.acquired": "(acquis par VMware!)",
  "ddxdevin.code.title": "Le Code",
  "ddxdevin.code.tags.github": "Code Source sur GitHub",
  "ddxdevin.code.tags.medium": "Guide d'installation sur Medium",
  "ddxdevin.code.gis.title": "Incendies de forêt à Los Angeles (2025) : serveur MCP CAL FIRE DINS",
  "ddxdevin.code.myturn.title": "Vaccins contre le COVID-19: MyTurn CA Moniteur de disponibilité",
  "ddxdevin.code.notify.title": "Vaccins contre le COVID-19: Système de notification de rendez-vous",
  "ddxdevin.photography.title": "La Photographie",
  "ddxdevin.photography.laMainOuverte": "La Main Ouverte",
  "ddxdevin.photography.bauhauslers": "Bauhäuslers",
  "ddxdevin.photography.se1": "(S)E1 [WIP]",
  "ddxdevin.talks.title": "Les Présentations",
  "ddxdevin.talks.bauhaus.title": "Architecture Bauhaus et l'UI de CloudHealth",
  "ddxdevin.links.title": "Les liens",
  "ddxdevin.links.linkedin": "LinkedIn",
  "ddxdevin.links.github": "GitHub",
  "ddxdevin.links.twitter": "Twitter",
  "ddxdevin.links.instagram": "Instagram",
  "ddxdevin.links.discogs": "Discogs",
  "ddxdevin.links.concerts": "Concerts",
  "ddxdevin.lmo.title": "La Main Ouverte",
  "ddxdevin.lmo.location": "Chandigarh, Inde",
  "ddxdevin.lmo.book": "Livre de 36 pages parfaitement relié",
  "ddxdevin.lmo.dimensions": "148 x 210mm",
  "ddxdevin.lmo.paper": "150 g/m² papier glacé",
  "ddxdevin.lmo.edition": "Édition limitée à 25",
  "ddxdevin.lmo.soldOut": "Rupture de stock.",
  "ddxdevin.lmo.images.alt.main": "Couverture recto et verso du zine La Main Ouverte montrant des images de Chandigarh",
  "ddxdevin.lmo.images.alt.1": "Illustration de la couverture intérieure et page de titre du zine : Chandigarh, Inde 2019",
  "ddxdevin.lmo.images.alt.2": "Image du paragraphe d'introduction de La Main Ouverte et l'histoire de Le Corbusier et Chandigarh",
  "ddxdevin.lmo.images.alt.default": "Double page avec des images de l'architecture de Le Corbusier à Chandigarh",
  "ddxdevin.bauhauslers.title": "Bauhäuslers",
  "ddxdevin.bauhauslers.bauhausler.term": "Bauhäusler",
  "ddxdevin.bauhauslers.bauhausler.definition": "un étudiant du bauhaus",
  "ddxdevin.bauhauslers.mieslinge.term": "Mieslinge",
  "ddxdevin.bauhauslers.mieslinge.definition": "terme désobligeant pour les étudiants copiant le maître, Mies van der Rohe; de \"Mies\" et de l'allemand \"misslingen\" [échec]",
  "ddxdevin.bauhauslers.images.alt.default": "Photographie de scènes de l'architecture emblématique du Bauhaus en Allemagne",
  "ddxdevin.se1.title": "Table Lumineuse",
  "ddxdevin.se1.description": "travaux en cours, choses à l'étude, livre à venir",
  "ddxdevin.se1.author": "direction artistique du livre par",
  "ddxdevin.se1.location": "Londres, Royaume-Uni",
  "ddxdevin.se1.images.alt.default": "Photographie de scènes urbaines des quartiers SE1 et E1 de Londres",
  "ddxdevin.bauhaus.title": "Bauhaus",
  "ddxdevin.bauhaus.talk.title": "Architecture Bauhaus et l'UI de CloudHealth",
  "ddxdevin.bauhaus.talk.description": "était une présentation que j'ai faite lorsque l'équipe CloudHealth a emménagé pour la première fois dans ses nouveaux bureaux au 100 Summer Street à Boston. Inspiré par le style internationaliste conventionnel du bâtiment, j'ai donné un aperçu de l'histoire de l'école Bauhaus et du mouvement associé afin de proposer un cadre permettant de comprendre les tendances actuelles de l'UI et d'appliquer les leçons du Bauhaus pour construire notre nouveau «design system».",
  "ddxdevin.bauhaus.images.alt.main": "Capture d'écran de la fenêtre du navigateur avec la diapositive de titre principale de Google Slides: 100 Summer, Architecture Bauhaus et l'UI de CloudHealth",
  "ddxdevin.bauhaus.images.alt.1": "Aperçu de la diapositive : Qu'est-ce que l'architecture ?",
  "ddxdevin.bauhaus.images.alt.2": "Aperçu de la diapositive: le modernisme américain. Illustration du drapeau américain",
  "ddxdevin.bauhaus.images.alt.3": "Aperçu de la diapositive: introduction au Bauhaus en tant qu'école qui existait entre les deux guerres mondiales. Illustration des plages de dates des deux guerres mondiales et de la façon dont le Bauhaus se situe au milieu des deux périodes",
  "ddxdevin.bauhaus.images.alt.4": "Aperçu de la diapositive: série de photographies d'immeubles de bureaux de type gratte-ciel modernistes illustrant l'uniformité de l'horizon des entreprises américaines",
  "ddxdevin.bauhaus.images.alt.5": "Aperçu de la diapositive: série de blocs de texte décrivant les éléments clés de l'architecture moderniste : des logements de production de masse dans des environnements d'après-guerre, des composants préfabriqués utilisés partout, fournissent des indices d'interaction, clarifient les intentions, un nouveau langage et garantissent une familiarité sans perte de caractère.",
  "ddxdevin.bauhaus.images.alt.6": "Aperçu de la diapositive: fournissez des indices pour l'interaction. Photo d'un article de presse avec en-tête : Les employés d'Apple ne peuvent s'empêcher de franchir les magnifiques portes vitrées du nouveau campus Apple Park avec une photo de murs de verre allant du sol au plafond.",
  "ddxdevin.bauhaus.images.alt.7": "Aperçu de la diapositive: illustrations d'exemples du style international notant « Réduire les structures à leurs éléments structurels les plus élémentaires » et sur les wireframes et le prototypage, « Sans appliquer de fouillis visuel, votre contenu peut-il se comporter seul ? »",
  "ddxdevin.bauhaus.images.alt.8": "Aperçu de la diapositive: illustration de graphiques de style international avec de nombreuses lignes diagonales de différentes largeurs se croisant sur le canevas de la diapositive. Considérations pour la création de notre UI: interaction, fonction, contexte, espace, clarté, etc.",
  "ddxdevin.bauhaus.images.alt.9": "Aperçu de la diapositive: série de captures d'écran de pages de destination d'entreprise montrant l'uniformité de la direction artistique avec des figures humaines exagérées à la peau bleue",
  "ddxdevin.bauhaus.images.alt.10": "Aperçu de la diapositive: série de captures d'écran de la direction artistique post-moderniste de diverses entreprises et de leur matériel publicitaire montrant des illustrations graphiques abstraites et des polices de caractères exagérées.",
  "ddxdevin.concerts.title": "Journal des Concerts",
  "ddxdevin.concerts.search": "Rechercher",
  "ddxdevin.concerts.loading": "Chargement",
  "ddxdevin.concerts.indicator": "indique plusieurs concerts",
  "ddxdevin.concerts.lastUpdated": "Dernière mise à jour",
  "ddxdevin.concerts.encore": "Encore (dernier concert)"
}
